import {
  getTranslation,
  getMainFile,
  findByModalName,
  findByTabName,
  getLangArray
} from "@/components/utils/actions";
import SearchComponent from "@/components/shared/SearchComponent";
import BreadCrumb from "@/components/shared/BreadCrumb";
import { findByUniqueId } from "@/components/utils/findByUniqueId";
import FreeId from "./components/FreeId";
import RondId from "./components/RondId"
// SEO**
export async function generateMetadata({ params }: { params: { lang: string } }) {
  const langData = await getTranslation(params.lang);

  const mainData = await getMainFile(langData);





  //to make description less than 200 character
  async function makeLessCharacter() {
    let temp = findByUniqueId(mainData, 596)
    return await temp.slice(0, 200)
  }

  return {
    title: findByUniqueId(mainData, 1484),
    description: "اینجا مجموعه‌ای از شناسه‌های رند و کمیاب قرار گرفته که به دلیل سادگی و ارزش بالای عددی، انتخابی متفاوت نسبت به شناسه‌های معمولی محسوب می‌شوند. هر شناسه با جزئیات دقیق نمایش داده شده تا بتوانید بدون دردسر مناسب‌ترین گزینه را انتخاب و خریداری کنید. هدف ما ارائه انتخاب‌های واقعی، شفاف و قابل اعتماد است؛ شما فقط لیست نمی‌بینید—بلکه بهترین گزینه‌ها را از میان هزاران شناسه آماده خرید در اختیار دارید.",
    openGraph: {
      type: 'website',
      // url: `https://rgb.irpsc.com/posts/${params.id}`,
      title: findByUniqueId(mainData, 593),
      description: "اینجا مجموعه‌ای از شناسه‌های رند و کمیاب قرار گرفته که به دلیل سادگی و ارزش بالای عددی، انتخابی متفاوت نسبت به شناسه‌های معمولی محسوب می‌شوند. هر شناسه با جزئیات دقیق نمایش داده شده تا بتوانید بدون دردسر مناسب‌ترین گزینه را انتخاب و خریداری کنید. هدف ما ارائه انتخاب‌های واقعی، شفاف و قابل اعتماد است؛ شما فقط لیست نمی‌بینید—بلکه بهترین گزینه‌ها را از میان هزاران شناسه آماده خرید در اختیار دارید.",
      locale: params.lang == "fa" ? "fa_IR" : "en_US",
      // site_name: متاورس رنگ,
      url: `https://rgb.irpsc.com/${params.lang}/citizen/rand-is/hm`,
      images: [
        {
          url: "/logo.png",
          width: 800,
          height: 600,
          // alt: post.title,
        },
      ],
    },
    // twitter: {
    //   card: 'summary_large_image',
    //   title: post.title,
    //   description: post.description,
    //   images: [post.imageUrl],
    // },
  };
}

export default async function RounPage({ params }: { params: { lang: string } }) {
  const [langData, langArray] = await Promise.all([

    getTranslation(params.lang),
    getLangArray(),
  ]);
  const mainData = await getMainFile(langData);
  const title = findByUniqueId(mainData, 1484)
  const desc = findByUniqueId(mainData, 596).slice(0, 200)
  const citizenData = [
    {
      id: "HM-2000100",
      percent: 76,
      prices: {
        IRR: ["1,560,000 " + findByUniqueId(mainData, 1487)],
        USD: "$37.14",
        BTC: "₿0.0013",
        USDT: "T37.14"
      },
      currencies: [
        {
          key: "IRR", label: "ریال", icon: `
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M25.7331 10.5619V17.4286C25.7331 21.5353 23.3865 23.2952 19.8665 23.2952H8.14644C7.54644 23.2952 6.97311 23.242 6.43978 23.122C6.10645 23.0687 5.78646 22.9753 5.49312 22.8687C3.49312 22.122 2.27979 20.3886 2.27979 17.4286V10.5619C2.27979 6.45526 4.62644 4.69531 8.14644 4.69531H19.8665C22.8531 4.69531 24.9998 5.96197 25.5731 8.85531C25.6665 9.38864 25.7331 9.93526 25.7331 10.5619Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M29.7347 14.566V21.4327C29.7347 25.5394 27.3881 27.2993 23.8681 27.2993H12.1481C11.1614 27.2993 10.2681 27.1661 9.49475 26.8727C7.90808 26.2861 6.82807 25.0727 6.44141 23.1261C6.97474 23.2461 7.54807 23.2993 8.14807 23.2993H19.8681C23.3881 23.2993 25.7347 21.5394 25.7347 17.4327V10.566C25.7347 9.93933 25.6814 9.37937 25.5747 8.85938C28.1081 9.39271 29.7347 11.1793 29.7347 14.566Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M13.9976 17.5244C15.9416 17.5244 17.5176 15.9484 17.5176 14.0044C17.5176 12.0604 15.9416 10.4844 13.9976 10.4844C12.0535 10.4844 10.4775 12.0604 10.4775 14.0044C10.4775 15.9484 12.0535 17.5244 13.9976 17.5244Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M6.37305 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M21.6289 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          ` },
        {
          key: "USD", label: "Dollar", icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <circle cx="14" cy="14" r="14" fill="#00A94B"/>
          <path d="M9.625 17.0625C9.625 18.758 10.9237 20.125 12.5373 20.125H15.83C17.2337 20.125 18.375 18.9289 18.375 17.4568C18.375 15.8533 17.6797 15.2881 16.6434 14.9201L11.3566 13.0799C10.3203 12.7119 9.625 12.1467 9.625 10.5432C9.625 9.07108 10.7663 7.875 12.17 7.875H15.4627C17.0763 7.875 18.375 9.24195 18.375 10.9375" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M14 6.125V21.875" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "BTC", label: findByUniqueId(mainData, 1491), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.5814 17.3867C25.7116 24.8867 18.1153 29.4511 10.6143 27.5809C3.11647 25.7111 -1.44792 18.1142 0.422697 10.6148C2.29168 3.11387 9.88804 -1.45087 17.3867 0.418928C24.8871 2.28873 29.4512 9.88639 27.5812 17.3868L27.5813 17.3867H27.5814Z" fill="#F7931A"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.1752 12.0029C20.4538 10.1399 19.0354 9.13837 17.0958 8.47028L17.725 5.94656L16.1887 5.56376L15.5762 8.02103C15.1723 7.9203 14.7576 7.82539 14.3453 7.7313L14.9623 5.2578L13.427 4.875L12.7974 7.3979C12.4632 7.32181 12.135 7.2466 11.8165 7.16736L11.8183 7.15942L9.69972 6.63038L9.29105 8.27122C9.29105 8.27122 10.4308 8.53249 10.4068 8.54857C11.0289 8.70384 11.1414 9.11565 11.1227 9.44207L10.406 12.3172C10.4488 12.3281 10.5044 12.3438 10.5657 12.3684L10.5211 12.3573C10.4832 12.3478 10.4438 12.338 10.4033 12.3283L9.39869 16.3559C9.32266 16.5449 9.12969 16.8285 8.69474 16.7208C8.71014 16.7431 7.57816 16.4422 7.57816 16.4422L6.81543 18.2007L8.81463 18.6991C9.03353 18.754 9.24984 18.8104 9.46395 18.8662L9.46406 18.8662C9.61371 18.9052 9.76229 18.944 9.90994 18.9817L9.27421 21.5344L10.8087 21.9172L11.4383 19.3916C11.8575 19.5054 12.2643 19.6104 12.6626 19.7093L12.0351 22.223L13.5715 22.6058L14.2071 20.0579C16.8268 20.5537 18.7966 20.3538 19.6257 17.9843C20.2938 16.0766 19.5924 14.9763 18.2142 14.2587C19.218 14.0272 19.9741 13.367 20.1757 12.0032L20.1752 12.0028L20.1752 12.0029ZM16.6651 16.9249C16.2296 18.6752 13.4899 17.9516 12.2364 17.6205C12.1237 17.5907 12.0229 17.5641 11.937 17.5428L12.7806 14.1609C12.8853 14.1871 13.0133 14.2158 13.1584 14.2483L13.1584 14.2483C14.4549 14.5393 17.1114 15.1355 16.6652 16.9249H16.6651ZM13.4184 12.6788C14.4635 12.9577 16.7432 13.5661 17.1403 11.9753H17.1404C17.5458 10.3483 15.3303 9.85782 14.2482 9.61826C14.1265 9.59131 14.0191 9.56753 13.9314 9.54567L13.1666 12.6128C13.2388 12.6308 13.3235 12.6534 13.4184 12.6788Z" fill="white"/>
          </svg>
          ` },
        {
          key: "USDT", label: findByUniqueId(mainData, 1493), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.578 17.3867C25.7082 24.8867 18.1118 29.4511 10.6109 27.5809C3.11305 25.7111 -1.45134 18.1142 0.419279 10.6148C2.28826 3.11387 9.88462 -1.45087 17.3833 0.418928C24.8837 2.28873 29.4478 9.88639 27.5778 17.3868L27.5779 17.3867H27.578Z" fill="#50AF95"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M15.7714 15.5873C15.6724 15.5947 15.161 15.6253 14.0201 15.6253C13.1126 15.6253 12.4684 15.598 12.2423 15.5873C8.73551 15.4331 6.11797 14.8226 6.11797 14.0917C6.11797 13.3608 8.73551 12.7512 12.2423 12.5944V14.9793C12.4717 14.9958 13.1283 15.0346 14.0357 15.0346C15.1247 15.0346 15.6699 14.9892 15.7681 14.9802V12.5961C19.2675 12.752 21.8793 13.3625 21.8793 14.0917C21.8793 14.821 19.2683 15.4314 15.7681 15.5865L15.7714 15.5873ZM15.7714 12.3494V10.2153H20.655V6.96094H7.35868V10.2153H12.2415V12.3486C8.27271 12.5309 5.28809 13.3171 5.28809 14.2592C5.28809 15.2013 8.27271 15.9866 12.2415 16.1697V23.0085H15.7706V16.1673C19.7303 15.9849 22.71 15.1996 22.71 14.2583C22.71 13.3171 19.7328 12.5317 15.7706 12.3486L15.7714 12.3494Z" fill="white"/>
          </svg>
          `  },
      ],
    },

    {
      id: "HM-2000101",
      percent: 82,
      prices: {
        IRR: ["2,140,000 " + findByUniqueId(mainData, 1487)],
        USD: "$50.95",
        BTC: "₿0.0018"
      },
      currencies: [
        {
          key: "IRR", label: "ریال", icon: `
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M25.7331 10.5619V17.4286C25.7331 21.5353 23.3865 23.2952 19.8665 23.2952H8.14644C7.54644 23.2952 6.97311 23.242 6.43978 23.122C6.10645 23.0687 5.78646 22.9753 5.49312 22.8687C3.49312 22.122 2.27979 20.3886 2.27979 17.4286V10.5619C2.27979 6.45526 4.62644 4.69531 8.14644 4.69531H19.8665C22.8531 4.69531 24.9998 5.96197 25.5731 8.85531C25.6665 9.38864 25.7331 9.93526 25.7331 10.5619Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M29.7347 14.566V21.4327C29.7347 25.5394 27.3881 27.2993 23.8681 27.2993H12.1481C11.1614 27.2993 10.2681 27.1661 9.49475 26.8727C7.90808 26.2861 6.82807 25.0727 6.44141 23.1261C6.97474 23.2461 7.54807 23.2993 8.14807 23.2993H19.8681C23.3881 23.2993 25.7347 21.5394 25.7347 17.4327V10.566C25.7347 9.93933 25.6814 9.37937 25.5747 8.85938C28.1081 9.39271 29.7347 11.1793 29.7347 14.566Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M13.9976 17.5244C15.9416 17.5244 17.5176 15.9484 17.5176 14.0044C17.5176 12.0604 15.9416 10.4844 13.9976 10.4844C12.0535 10.4844 10.4775 12.0604 10.4775 14.0044C10.4775 15.9484 12.0535 17.5244 13.9976 17.5244Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M6.37305 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M21.6289 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          ` },
        {
          key: "USD", label: "Dollar", icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <circle cx="14" cy="14" r="14" fill="#00A94B"/>
          <path d="M9.625 17.0625C9.625 18.758 10.9237 20.125 12.5373 20.125H15.83C17.2337 20.125 18.375 18.9289 18.375 17.4568C18.375 15.8533 17.6797 15.2881 16.6434 14.9201L11.3566 13.0799C10.3203 12.7119 9.625 12.1467 9.625 10.5432C9.625 9.07108 10.7663 7.875 12.17 7.875H15.4627C17.0763 7.875 18.375 9.24195 18.375 10.9375" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M14 6.125V21.875" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "BTC", label: findByUniqueId(mainData, 1491), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.5814 17.3867C25.7116 24.8867 18.1153 29.4511 10.6143 27.5809C3.11647 25.7111 -1.44792 18.1142 0.422697 10.6148C2.29168 3.11387 9.88804 -1.45087 17.3867 0.418928C24.8871 2.28873 29.4512 9.88639 27.5812 17.3868L27.5813 17.3867H27.5814Z" fill="#F7931A"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.1752 12.0029C20.4538 10.1399 19.0354 9.13837 17.0958 8.47028L17.725 5.94656L16.1887 5.56376L15.5762 8.02103C15.1723 7.9203 14.7576 7.82539 14.3453 7.7313L14.9623 5.2578L13.427 4.875L12.7974 7.3979C12.4632 7.32181 12.135 7.2466 11.8165 7.16736L11.8183 7.15942L9.69972 6.63038L9.29105 8.27122C9.29105 8.27122 10.4308 8.53249 10.4068 8.54857C11.0289 8.70384 11.1414 9.11565 11.1227 9.44207L10.406 12.3172C10.4488 12.3281 10.5044 12.3438 10.5657 12.3684L10.5211 12.3573C10.4832 12.3478 10.4438 12.338 10.4033 12.3283L9.39869 16.3559C9.32266 16.5449 9.12969 16.8285 8.69474 16.7208C8.71014 16.7431 7.57816 16.4422 7.57816 16.4422L6.81543 18.2007L8.81463 18.6991C9.03353 18.754 9.24984 18.8104 9.46395 18.8662L9.46406 18.8662C9.61371 18.9052 9.76229 18.944 9.90994 18.9817L9.27421 21.5344L10.8087 21.9172L11.4383 19.3916C11.8575 19.5054 12.2643 19.6104 12.6626 19.7093L12.0351 22.223L13.5715 22.6058L14.2071 20.0579C16.8268 20.5537 18.7966 20.3538 19.6257 17.9843C20.2938 16.0766 19.5924 14.9763 18.2142 14.2587C19.218 14.0272 19.9741 13.367 20.1757 12.0032L20.1752 12.0028L20.1752 12.0029ZM16.6651 16.9249C16.2296 18.6752 13.4899 17.9516 12.2364 17.6205C12.1237 17.5907 12.0229 17.5641 11.937 17.5428L12.7806 14.1609C12.8853 14.1871 13.0133 14.2158 13.1584 14.2483L13.1584 14.2483C14.4549 14.5393 17.1114 15.1355 16.6652 16.9249H16.6651ZM13.4184 12.6788C14.4635 12.9577 16.7432 13.5661 17.1403 11.9753H17.1404C17.5458 10.3483 15.3303 9.85782 14.2482 9.61826C14.1265 9.59131 14.0191 9.56753 13.9314 9.54567L13.1666 12.6128C13.2388 12.6308 13.3235 12.6534 13.4184 12.6788Z" fill="white"/>
          </svg>
          ` },
      ],
    },

    // -------------------------------
    // 3
    {
      id: "HM-2000102",
      percent: 68,
      prices: {
        IRR: ["1,320,000 " + findByUniqueId(mainData, 1487)],
        USD: "$31.50",
        BTC: "₿0.0011"
      },
      currencies: [
        {
          key: "IRR", label: "ریال", icon: `
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M25.7331 10.5619V17.4286C25.7331 21.5353 23.3865 23.2952 19.8665 23.2952H8.14644C7.54644 23.2952 6.97311 23.242 6.43978 23.122C6.10645 23.0687 5.78646 22.9753 5.49312 22.8687C3.49312 22.122 2.27979 20.3886 2.27979 17.4286V10.5619C2.27979 6.45526 4.62644 4.69531 8.14644 4.69531H19.8665C22.8531 4.69531 24.9998 5.96197 25.5731 8.85531C25.6665 9.38864 25.7331 9.93526 25.7331 10.5619Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M29.7347 14.566V21.4327C29.7347 25.5394 27.3881 27.2993 23.8681 27.2993H12.1481C11.1614 27.2993 10.2681 27.1661 9.49475 26.8727C7.90808 26.2861 6.82807 25.0727 6.44141 23.1261C6.97474 23.2461 7.54807 23.2993 8.14807 23.2993H19.8681C23.3881 23.2993 25.7347 21.5394 25.7347 17.4327V10.566C25.7347 9.93933 25.6814 9.37937 25.5747 8.85938C28.1081 9.39271 29.7347 11.1793 29.7347 14.566Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M13.9976 17.5244C15.9416 17.5244 17.5176 15.9484 17.5176 14.0044C17.5176 12.0604 15.9416 10.4844 13.9976 10.4844C12.0535 10.4844 10.4775 12.0604 10.4775 14.0044C10.4775 15.9484 12.0535 17.5244 13.9976 17.5244Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M6.37305 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M21.6289 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          ` },
        {
          key: "USD", label: "Dollar", icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <circle cx="14" cy="14" r="14" fill="#00A94B"/>
          <path d="M9.625 17.0625C9.625 18.758 10.9237 20.125 12.5373 20.125H15.83C17.2337 20.125 18.375 18.9289 18.375 17.4568C18.375 15.8533 17.6797 15.2881 16.6434 14.9201L11.3566 13.0799C10.3203 12.7119 9.625 12.1467 9.625 10.5432C9.625 9.07108 10.7663 7.875 12.17 7.875H15.4627C17.0763 7.875 18.375 9.24195 18.375 10.9375" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M14 6.125V21.875" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "BTC", label: findByUniqueId(mainData, 1491), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.5814 17.3867C25.7116 24.8867 18.1153 29.4511 10.6143 27.5809C3.11647 25.7111 -1.44792 18.1142 0.422697 10.6148C2.29168 3.11387 9.88804 -1.45087 17.3867 0.418928C24.8871 2.28873 29.4512 9.88639 27.5812 17.3868L27.5813 17.3867H27.5814Z" fill="#F7931A"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.1752 12.0029C20.4538 10.1399 19.0354 9.13837 17.0958 8.47028L17.725 5.94656L16.1887 5.56376L15.5762 8.02103C15.1723 7.9203 14.7576 7.82539 14.3453 7.7313L14.9623 5.2578L13.427 4.875L12.7974 7.3979C12.4632 7.32181 12.135 7.2466 11.8165 7.16736L11.8183 7.15942L9.69972 6.63038L9.29105 8.27122C9.29105 8.27122 10.4308 8.53249 10.4068 8.54857C11.0289 8.70384 11.1414 9.11565 11.1227 9.44207L10.406 12.3172C10.4488 12.3281 10.5044 12.3438 10.5657 12.3684L10.5211 12.3573C10.4832 12.3478 10.4438 12.338 10.4033 12.3283L9.39869 16.3559C9.32266 16.5449 9.12969 16.8285 8.69474 16.7208C8.71014 16.7431 7.57816 16.4422 7.57816 16.4422L6.81543 18.2007L8.81463 18.6991C9.03353 18.754 9.24984 18.8104 9.46395 18.8662L9.46406 18.8662C9.61371 18.9052 9.76229 18.944 9.90994 18.9817L9.27421 21.5344L10.8087 21.9172L11.4383 19.3916C11.8575 19.5054 12.2643 19.6104 12.6626 19.7093L12.0351 22.223L13.5715 22.6058L14.2071 20.0579C16.8268 20.5537 18.7966 20.3538 19.6257 17.9843C20.2938 16.0766 19.5924 14.9763 18.2142 14.2587C19.218 14.0272 19.9741 13.367 20.1757 12.0032L20.1752 12.0028L20.1752 12.0029ZM16.6651 16.9249C16.2296 18.6752 13.4899 17.9516 12.2364 17.6205C12.1237 17.5907 12.0229 17.5641 11.937 17.5428L12.7806 14.1609C12.8853 14.1871 13.0133 14.2158 13.1584 14.2483L13.1584 14.2483C14.4549 14.5393 17.1114 15.1355 16.6652 16.9249H16.6651ZM13.4184 12.6788C14.4635 12.9577 16.7432 13.5661 17.1403 11.9753H17.1404C17.5458 10.3483 15.3303 9.85782 14.2482 9.61826C14.1265 9.59131 14.0191 9.56753 13.9314 9.54567L13.1666 12.6128C13.2388 12.6308 13.3235 12.6534 13.4184 12.6788Z" fill="white"/>
          </svg>
          ` }
      ],
    },

    // -------------------------------
    // 4
    {
      id: "HM-2000103",
      percent: 91,
      prices: {
        IRR: ["3,450,000 " + findByUniqueId(mainData, 1487)],
        USD: "$82.77",
        BTC: "₿0.0029",
        USDT: "T82.77"
      },
      currencies: [
        {
          key: "IRR", label: "ریال", icon: `
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M25.7331 10.5619V17.4286C25.7331 21.5353 23.3865 23.2952 19.8665 23.2952H8.14644C7.54644 23.2952 6.97311 23.242 6.43978 23.122C6.10645 23.0687 5.78646 22.9753 5.49312 22.8687C3.49312 22.122 2.27979 20.3886 2.27979 17.4286V10.5619C2.27979 6.45526 4.62644 4.69531 8.14644 4.69531H19.8665C22.8531 4.69531 24.9998 5.96197 25.5731 8.85531C25.6665 9.38864 25.7331 9.93526 25.7331 10.5619Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M29.7347 14.566V21.4327C29.7347 25.5394 27.3881 27.2993 23.8681 27.2993H12.1481C11.1614 27.2993 10.2681 27.1661 9.49475 26.8727C7.90808 26.2861 6.82807 25.0727 6.44141 23.1261C6.97474 23.2461 7.54807 23.2993 8.14807 23.2993H19.8681C23.3881 23.2993 25.7347 21.5394 25.7347 17.4327V10.566C25.7347 9.93933 25.6814 9.37937 25.5747 8.85938C28.1081 9.39271 29.7347 11.1793 29.7347 14.566Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M13.9976 17.5244C15.9416 17.5244 17.5176 15.9484 17.5176 14.0044C17.5176 12.0604 15.9416 10.4844 13.9976 10.4844C12.0535 10.4844 10.4775 12.0604 10.4775 14.0044C10.4775 15.9484 12.0535 17.5244 13.9976 17.5244Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M6.37305 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M21.6289 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "USD", label: "Dollar", icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <circle cx="14" cy="14" r="14" fill="#00A94B"/>
          <path d="M9.625 17.0625C9.625 18.758 10.9237 20.125 12.5373 20.125H15.83C17.2337 20.125 18.375 18.9289 18.375 17.4568C18.375 15.8533 17.6797 15.2881 16.6434 14.9201L11.3566 13.0799C10.3203 12.7119 9.625 12.1467 9.625 10.5432C9.625 9.07108 10.7663 7.875 12.17 7.875H15.4627C17.0763 7.875 18.375 9.24195 18.375 10.9375" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M14 6.125V21.875" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "BTC", label: findByUniqueId(mainData, 1491), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.5814 17.3867C25.7116 24.8867 18.1153 29.4511 10.6143 27.5809C3.11647 25.7111 -1.44792 18.1142 0.422697 10.6148C2.29168 3.11387 9.88804 -1.45087 17.3867 0.418928C24.8871 2.28873 29.4512 9.88639 27.5812 17.3868L27.5813 17.3867H27.5814Z" fill="#F7931A"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.1752 12.0029C20.4538 10.1399 19.0354 9.13837 17.0958 8.47028L17.725 5.94656L16.1887 5.56376L15.5762 8.02103C15.1723 7.9203 14.7576 7.82539 14.3453 7.7313L14.9623 5.2578L13.427 4.875L12.7974 7.3979C12.4632 7.32181 12.135 7.2466 11.8165 7.16736L11.8183 7.15942L9.69972 6.63038L9.29105 8.27122C9.29105 8.27122 10.4308 8.53249 10.4068 8.54857C11.0289 8.70384 11.1414 9.11565 11.1227 9.44207L10.406 12.3172C10.4488 12.3281 10.5044 12.3438 10.5657 12.3684L10.5211 12.3573C10.4832 12.3478 10.4438 12.338 10.4033 12.3283L9.39869 16.3559C9.32266 16.5449 9.12969 16.8285 8.69474 16.7208C8.71014 16.7431 7.57816 16.4422 7.57816 16.4422L6.81543 18.2007L8.81463 18.6991C9.03353 18.754 9.24984 18.8104 9.46395 18.8662L9.46406 18.8662C9.61371 18.9052 9.76229 18.944 9.90994 18.9817L9.27421 21.5344L10.8087 21.9172L11.4383 19.3916C11.8575 19.5054 12.2643 19.6104 12.6626 19.7093L12.0351 22.223L13.5715 22.6058L14.2071 20.0579C16.8268 20.5537 18.7966 20.3538 19.6257 17.9843C20.2938 16.0766 19.5924 14.9763 18.2142 14.2587C19.218 14.0272 19.9741 13.367 20.1757 12.0032L20.1752 12.0028L20.1752 12.0029ZM16.6651 16.9249C16.2296 18.6752 13.4899 17.9516 12.2364 17.6205C12.1237 17.5907 12.0229 17.5641 11.937 17.5428L12.7806 14.1609C12.8853 14.1871 13.0133 14.2158 13.1584 14.2483L13.1584 14.2483C14.4549 14.5393 17.1114 15.1355 16.6652 16.9249H16.6651ZM13.4184 12.6788C14.4635 12.9577 16.7432 13.5661 17.1403 11.9753H17.1404C17.5458 10.3483 15.3303 9.85782 14.2482 9.61826C14.1265 9.59131 14.0191 9.56753 13.9314 9.54567L13.1666 12.6128C13.2388 12.6308 13.3235 12.6534 13.4184 12.6788Z" fill="white"/>
          </svg>
          ` },
        {
          key: "USDT", label: findByUniqueId(mainData, 1493), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.578 17.3867C25.7082 24.8867 18.1118 29.4511 10.6109 27.5809C3.11305 25.7111 -1.45134 18.1142 0.419279 10.6148C2.28826 3.11387 9.88462 -1.45087 17.3833 0.418928C24.8837 2.28873 29.4478 9.88639 27.5778 17.3868L27.5779 17.3867H27.578Z" fill="#50AF95"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M15.7714 15.5873C15.6724 15.5947 15.161 15.6253 14.0201 15.6253C13.1126 15.6253 12.4684 15.598 12.2423 15.5873C8.73551 15.4331 6.11797 14.8226 6.11797 14.0917C6.11797 13.3608 8.73551 12.7512 12.2423 12.5944V14.9793C12.4717 14.9958 13.1283 15.0346 14.0357 15.0346C15.1247 15.0346 15.6699 14.9892 15.7681 14.9802V12.5961C19.2675 12.752 21.8793 13.3625 21.8793 14.0917C21.8793 14.821 19.2683 15.4314 15.7681 15.5865L15.7714 15.5873ZM15.7714 12.3494V10.2153H20.655V6.96094H7.35868V10.2153H12.2415V12.3486C8.27271 12.5309 5.28809 13.3171 5.28809 14.2592C5.28809 15.2013 8.27271 15.9866 12.2415 16.1697V23.0085H15.7706V16.1673C19.7303 15.9849 22.71 15.1996 22.71 14.2583C22.71 13.3171 19.7328 12.5317 15.7706 12.3486L15.7714 12.3494Z" fill="white"/>
          </svg>
          ` },
      ],
    },

    // -------------------------------
    // 5
    {
      id: "HM-2000104",
      percent: 74,
      prices: {
        IRR: ["1,980,000 " + findByUniqueId(mainData, 1487)],
        USD: "$46.10",
        BTC: "₿0.0016"
      },
      currencies: [
        {
          key: "IRR", label: "ریال", icon: `
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M25.7331 10.5619V17.4286C25.7331 21.5353 23.3865 23.2952 19.8665 23.2952H8.14644C7.54644 23.2952 6.97311 23.242 6.43978 23.122C6.10645 23.0687 5.78646 22.9753 5.49312 22.8687C3.49312 22.122 2.27979 20.3886 2.27979 17.4286V10.5619C2.27979 6.45526 4.62644 4.69531 8.14644 4.69531H19.8665C22.8531 4.69531 24.9998 5.96197 25.5731 8.85531C25.6665 9.38864 25.7331 9.93526 25.7331 10.5619Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M29.7347 14.566V21.4327C29.7347 25.5394 27.3881 27.2993 23.8681 27.2993H12.1481C11.1614 27.2993 10.2681 27.1661 9.49475 26.8727C7.90808 26.2861 6.82807 25.0727 6.44141 23.1261C6.97474 23.2461 7.54807 23.2993 8.14807 23.2993H19.8681C23.3881 23.2993 25.7347 21.5394 25.7347 17.4327V10.566C25.7347 9.93933 25.6814 9.37937 25.5747 8.85938C28.1081 9.39271 29.7347 11.1793 29.7347 14.566Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M13.9976 17.5244C15.9416 17.5244 17.5176 15.9484 17.5176 14.0044C17.5176 12.0604 15.9416 10.4844 13.9976 10.4844C12.0535 10.4844 10.4775 12.0604 10.4775 14.0044C10.4775 15.9484 12.0535 17.5244 13.9976 17.5244Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M6.37305 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M21.6289 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "USD", label: "Dollar", icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <circle cx="14" cy="14" r="14" fill="#00A94B"/>
          <path d="M9.625 17.0625C9.625 18.758 10.9237 20.125 12.5373 20.125H15.83C17.2337 20.125 18.375 18.9289 18.375 17.4568C18.375 15.8533 17.6797 15.2881 16.6434 14.9201L11.3566 13.0799C10.3203 12.7119 9.625 12.1467 9.625 10.5432C9.625 9.07108 10.7663 7.875 12.17 7.875H15.4627C17.0763 7.875 18.375 9.24195 18.375 10.9375" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M14 6.125V21.875" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "BTC", label: findByUniqueId(mainData, 1491), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.5814 17.3867C25.7116 24.8867 18.1153 29.4511 10.6143 27.5809C3.11647 25.7111 -1.44792 18.1142 0.422697 10.6148C2.29168 3.11387 9.88804 -1.45087 17.3867 0.418928C24.8871 2.28873 29.4512 9.88639 27.5812 17.3868L27.5813 17.3867H27.5814Z" fill="#F7931A"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.1752 12.0029C20.4538 10.1399 19.0354 9.13837 17.0958 8.47028L17.725 5.94656L16.1887 5.56376L15.5762 8.02103C15.1723 7.9203 14.7576 7.82539 14.3453 7.7313L14.9623 5.2578L13.427 4.875L12.7974 7.3979C12.4632 7.32181 12.135 7.2466 11.8165 7.16736L11.8183 7.15942L9.69972 6.63038L9.29105 8.27122C9.29105 8.27122 10.4308 8.53249 10.4068 8.54857C11.0289 8.70384 11.1414 9.11565 11.1227 9.44207L10.406 12.3172C10.4488 12.3281 10.5044 12.3438 10.5657 12.3684L10.5211 12.3573C10.4832 12.3478 10.4438 12.338 10.4033 12.3283L9.39869 16.3559C9.32266 16.5449 9.12969 16.8285 8.69474 16.7208C8.71014 16.7431 7.57816 16.4422 7.57816 16.4422L6.81543 18.2007L8.81463 18.6991C9.03353 18.754 9.24984 18.8104 9.46395 18.8662L9.46406 18.8662C9.61371 18.9052 9.76229 18.944 9.90994 18.9817L9.27421 21.5344L10.8087 21.9172L11.4383 19.3916C11.8575 19.5054 12.2643 19.6104 12.6626 19.7093L12.0351 22.223L13.5715 22.6058L14.2071 20.0579C16.8268 20.5537 18.7966 20.3538 19.6257 17.9843C20.2938 16.0766 19.5924 14.9763 18.2142 14.2587C19.218 14.0272 19.9741 13.367 20.1757 12.0032L20.1752 12.0028L20.1752 12.0029ZM16.6651 16.9249C16.2296 18.6752 13.4899 17.9516 12.2364 17.6205C12.1237 17.5907 12.0229 17.5641 11.937 17.5428L12.7806 14.1609C12.8853 14.1871 13.0133 14.2158 13.1584 14.2483L13.1584 14.2483C14.4549 14.5393 17.1114 15.1355 16.6652 16.9249H16.6651ZM13.4184 12.6788C14.4635 12.9577 16.7432 13.5661 17.1403 11.9753H17.1404C17.5458 10.3483 15.3303 9.85782 14.2482 9.61826C14.1265 9.59131 14.0191 9.56753 13.9314 9.54567L13.1666 12.6128C13.2388 12.6308 13.3235 12.6534 13.4184 12.6788Z" fill="white"/>
          </svg>
          ` }
      ],
    },

    // -------------------------------
    // 6
    {
      id: "HM-2000105",
      percent: 88,
      prices: {
        IRR: ["2,980,000 " + findByUniqueId(mainData, 1487)],
        USD: "$71.85",
        BTC: "₿0.0025",
        USDT: "T71.85"
      },
      currencies: [
        {
          key: "IRR", label: "ریال", icon: `
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M25.7331 10.5619V17.4286C25.7331 21.5353 23.3865 23.2952 19.8665 23.2952H8.14644C7.54644 23.2952 6.97311 23.242 6.43978 23.122C6.10645 23.0687 5.78646 22.9753 5.49312 22.8687C3.49312 22.122 2.27979 20.3886 2.27979 17.4286V10.5619C2.27979 6.45526 4.62644 4.69531 8.14644 4.69531H19.8665C22.8531 4.69531 24.9998 5.96197 25.5731 8.85531C25.6665 9.38864 25.7331 9.93526 25.7331 10.5619Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M29.7347 14.566V21.4327C29.7347 25.5394 27.3881 27.2993 23.8681 27.2993H12.1481C11.1614 27.2993 10.2681 27.1661 9.49475 26.8727C7.90808 26.2861 6.82807 25.0727 6.44141 23.1261C6.97474 23.2461 7.54807 23.2993 8.14807 23.2993H19.8681C23.3881 23.2993 25.7347 21.5394 25.7347 17.4327V10.566C25.7347 9.93933 25.6814 9.37937 25.5747 8.85938C28.1081 9.39271 29.7347 11.1793 29.7347 14.566Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M13.9976 17.5244C15.9416 17.5244 17.5176 15.9484 17.5176 14.0044C17.5176 12.0604 15.9416 10.4844 13.9976 10.4844C12.0535 10.4844 10.4775 12.0604 10.4775 14.0044C10.4775 15.9484 12.0535 17.5244 13.9976 17.5244Z" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M6.37305 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          <path class="stroke-light-primary dark:stroke-dark-primary" d="M21.6289 11.0703V16.937" stroke="#FFC700" stroke-width="1.5" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          ` },
        {
          key: "USD", label: "Dollar", icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <circle cx="14" cy="14" r="14" fill="#00A94B"/>
          <path d="M9.625 17.0625C9.625 18.758 10.9237 20.125 12.5373 20.125H15.83C17.2337 20.125 18.375 18.9289 18.375 17.4568C18.375 15.8533 17.6797 15.2881 16.6434 14.9201L11.3566 13.0799C10.3203 12.7119 9.625 12.1467 9.625 10.5432C9.625 9.07108 10.7663 7.875 12.17 7.875H15.4627C17.0763 7.875 18.375 9.24195 18.375 10.9375" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          <path d="M14 6.125V21.875" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
          `  },
        {
          key: "BTC", label: findByUniqueId(mainData, 1491), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.5814 17.3867C25.7116 24.8867 18.1153 29.4511 10.6143 27.5809C3.11647 25.7111 -1.44792 18.1142 0.422697 10.6148C2.29168 3.11387 9.88804 -1.45087 17.3867 0.418928C24.8871 2.28873 29.4512 9.88639 27.5812 17.3868L27.5813 17.3867H27.5814Z" fill="#F7931A"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M20.1752 12.0029C20.4538 10.1399 19.0354 9.13837 17.0958 8.47028L17.725 5.94656L16.1887 5.56376L15.5762 8.02103C15.1723 7.9203 14.7576 7.82539 14.3453 7.7313L14.9623 5.2578L13.427 4.875L12.7974 7.3979C12.4632 7.32181 12.135 7.2466 11.8165 7.16736L11.8183 7.15942L9.69972 6.63038L9.29105 8.27122C9.29105 8.27122 10.4308 8.53249 10.4068 8.54857C11.0289 8.70384 11.1414 9.11565 11.1227 9.44207L10.406 12.3172C10.4488 12.3281 10.5044 12.3438 10.5657 12.3684L10.5211 12.3573C10.4832 12.3478 10.4438 12.338 10.4033 12.3283L9.39869 16.3559C9.32266 16.5449 9.12969 16.8285 8.69474 16.7208C8.71014 16.7431 7.57816 16.4422 7.57816 16.4422L6.81543 18.2007L8.81463 18.6991C9.03353 18.754 9.24984 18.8104 9.46395 18.8662L9.46406 18.8662C9.61371 18.9052 9.76229 18.944 9.90994 18.9817L9.27421 21.5344L10.8087 21.9172L11.4383 19.3916C11.8575 19.5054 12.2643 19.6104 12.6626 19.7093L12.0351 22.223L13.5715 22.6058L14.2071 20.0579C16.8268 20.5537 18.7966 20.3538 19.6257 17.9843C20.2938 16.0766 19.5924 14.9763 18.2142 14.2587C19.218 14.0272 19.9741 13.367 20.1757 12.0032L20.1752 12.0028L20.1752 12.0029ZM16.6651 16.9249C16.2296 18.6752 13.4899 17.9516 12.2364 17.6205C12.1237 17.5907 12.0229 17.5641 11.937 17.5428L12.7806 14.1609C12.8853 14.1871 13.0133 14.2158 13.1584 14.2483L13.1584 14.2483C14.4549 14.5393 17.1114 15.1355 16.6652 16.9249H16.6651ZM13.4184 12.6788C14.4635 12.9577 16.7432 13.5661 17.1403 11.9753H17.1404C17.5458 10.3483 15.3303 9.85782 14.2482 9.61826C14.1265 9.59131 14.0191 9.56753 13.9314 9.54567L13.1666 12.6128C13.2388 12.6308 13.3235 12.6534 13.4184 12.6788Z" fill="white"/>
          </svg>
          ` },
        {
          key: "USDT", label: findByUniqueId(mainData, 1493), icon: `
          <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27.578 17.3867C25.7082 24.8867 18.1118 29.4511 10.6109 27.5809C3.11305 25.7111 -1.45134 18.1142 0.419279 10.6148C2.28826 3.11387 9.88462 -1.45087 17.3833 0.418928C24.8837 2.28873 29.4478 9.88639 27.5778 17.3868L27.5779 17.3867H27.578Z" fill="#50AF95"/>
          <path fill-rule="evenodd" clip-rule="evenodd" d="M15.7714 15.5873C15.6724 15.5947 15.161 15.6253 14.0201 15.6253C13.1126 15.6253 12.4684 15.598 12.2423 15.5873C8.73551 15.4331 6.11797 14.8226 6.11797 14.0917C6.11797 13.3608 8.73551 12.7512 12.2423 12.5944V14.9793C12.4717 14.9958 13.1283 15.0346 14.0357 15.0346C15.1247 15.0346 15.6699 14.9892 15.7681 14.9802V12.5961C19.2675 12.752 21.8793 13.3625 21.8793 14.0917C21.8793 14.821 19.2683 15.4314 15.7681 15.5865L15.7714 15.5873ZM15.7714 12.3494V10.2153H20.655V6.96094H7.35868V10.2153H12.2415V12.3486C8.27271 12.5309 5.28809 13.3171 5.28809 14.2592C5.28809 15.2013 8.27271 15.9866 12.2415 16.1697V23.0085H15.7706V16.1673C19.7303 15.9849 22.71 15.1996 22.71 14.2583C22.71 13.3171 19.7328 12.5317 15.7706 12.3486L15.7714 12.3494Z" fill="white"/>
          </svg>
          ` },
      ],
    },
  ];

  return (
    <>
      <script
        type="application/ld+json"
        dangerouslySetInnerHTML={{
          __html: JSON.stringify({
            "@context": "https://schema.org",
            "@type": "Product",
            name: findByUniqueId(mainData, 1484),
            description: findByUniqueId(mainData, 596)?.slice(0, 300) ||
              "مجموعه‌ای از شناسه‌های رند و کمیاب متاورس رنگ با ارزش عددی بالا و الگوهای خاص، آماده خرید فوری.",
            image: "https://rgb.irpsc.com/logo.png",
            brand: {
              "@type": "Brand",
              name: "متاورس رنگ"
            },
            sku: "citizen-rand-id-hm",
            offers: {
              "@type": "AggregateOffer",
              url: `https://rgb.irpsc.com/${params.lang}/citizen/rand-is/hm`,
              priceCurrency: "IRR",
              availability: "https://schema.org/InStock",
              offerCount: citizenData.length,
              lowPrice: Math.min(...citizenData.map(item =>
                parseFloat(item.prices.IRR[0].replace(/[^0-9]/g, "")) // فقط عدد ریال
              )),
              highPrice: Math.max(...citizenData.map(item =>
                parseFloat(item.prices.IRR[0].replace(/[^0-9]/g, ""))
              )),
              offers: citizenData.map((item) => ({
                "@type": "Offer",
                name: `${item.id} - شناسه رند (${item.percent}% ارزش)`,
                sku: item.id,
                priceCurrency: "IRR",
                price: item.prices.IRR[0].replace(/[^0-9]/g, ""), // فقط عدد
                availability: "https://schema.org/InStock",
                url: `https://rgb.irpsc.com/${params.lang}/citizen/rand-is/hm#${item.id}`,
                priceSpecification: [
                  {
                    "@type": "PriceSpecification",
                    priceCurrency: "IRR",
                    price: item.prices.IRR[0].replace(/[^0-9]/g, ""),
                    name: "قیمت به ریال"
                  },
                  ...(item.prices.USD
                    ? [{
                      "@type": "PriceSpecification",
                      priceCurrency: "USD",
                      price: parseFloat(item.prices.USD.replace("$", "")),
                      name: "قیمت به دلار"
                    }]
                    : []),
                  ...(item.prices.BTC
                    ? [{
                      "@type": "PriceSpecification",
                      priceCurrency: "BTC",
                      price: parseFloat(item.prices.BTC.replace("₿", "")),
                      name: "قیمت به بیت‌کوین"
                    }]
                    : []),
                  ...(item.prices.USDT
                    ? [{
                      "@type": "PriceSpecification",
                      priceCurrency: "USDT",
                      price: parseFloat(item.prices.USDT.replace("T", "")),
                      name: "قیمت به تتر"
                    }]
                    : [])
                ]
              }))
            }
          }, null, 2)
        }}
      />
      <script
        type="application/ld+json"
        dangerouslySetInnerHTML={{
          __html: JSON.stringify({
            "@context": "https://schema.org",
            "@type": "BreadcrumbList",
            itemListElement: [
              {
                "@type": "ListItem",
                position: 1,
                name: params.lang === "fa" ? "خانه" : "Home",
                item: `https://rgb.irpsc.com/${params.lang}`
              },
              {
                "@type": "ListItem",
                position: 2,
                name: params.lang === "fa" ? "شهروندی" : "Citizen",
                item: `https://rgb.irpsc.com/${params.lang}/citizen`
              },
              {
                "@type": "ListItem",
                position: 3,
                name: findByUniqueId(mainData, 1484),
                item: `https://rgb.irpsc.com/${params.lang}/citizen/rand-is/hm`
              }
            ]
          })
        }}
      />



      <div className=" w-full relative" dir={langData.direction}>

        <section
          className={`w-full mt-[60px] lg:mt-0 lg:pt-0 bg-[#f8f8f8] dark:bg-black bg-opacity20 `}
        >
          {/* Breadcrumb */}
          <div className="xl:px-32 lg:px-32 md:px-5 sm:px-5 xs:px-1">
            <BreadCrumb params={params} />
          </div>
          <div className="mt-[60px] lg:mt-[40px] xl:px-32 lg:px-32 md:px-5 sm:px-5 xs:px-1">
            <h1 className="font-rokh font-bold text-[24px] sm:text-[26px] md:text-[28px] lg:text-[30px] xl:text-[32px] text-center dark:text-white mt-[64px] mb-[16px]">
              {findByUniqueId(mainData, 1484)}
            </h1>
            <p className="text-lightGray  dark:text-lightGray font-azarMehr font-normal text-[16px] sm:text-[18px] md:text-[20px] lg:text-[22px] xl:text-[24px] text-center px-5 lg:px-10">
              اینجا مجموعه‌ای از شناسه‌های رند و کمیاب قرار گرفته که به دلیل سادگی و ارزش بالای عددی، انتخابی متفاوت نسبت به شناسه‌های معمولی محسوب می‌شوند. هر شناسه با جزئیات دقیق نمایش داده شده تا بتوانید بدون دردسر مناسب‌ترین گزینه را انتخاب و خریداری کنید. هدف ما ارائه انتخاب‌های واقعی، شفاف و قابل اعتماد است؛ شما فقط لیست نمی‌بینید—بلکه بهترین گزینه‌ها را از میان هزاران شناسه آماده خرید در اختیار دارید.
            </p>
            <div className="flex justify-center w-full px-5 lg:px-0">
              <SearchComponent
                searchLevel='citizen'
                mainData={mainData}
                params={params}
              />
            </div>
          </div>
          <div>
            <FreeId
              mainData={mainData}
              params={params} />
          </div>
          <div>
            <RondId
              mainData={mainData}
              params={params} />
          </div>
        </section>
      </div>
    </>
  );
}
