
export const articles = [
  {
    id: 1,
    title: "هدف از ساخت متاورس ملی چیست و چه خدماتی برای ایران و ایرانی دارد ؟",
    slug: "national-metaverse1",
    date: "2022-08-14", // میلادی برای سورت
    image: "/articles1.png",
    excerpt: " متاورس ملی اهداف زیادی از قبیل عدم خروج ارز از کشور و در فازهای بعدی ورود ارز به کشور را دارد که این ها همه بخشی کوچکی از اهداف متاورس ملی می باشد. ",
    description: ` <h2>سخن مدیرعامل</h2>
      <p>در این خصوص به بخشی از هدف و چشم انداز متاورس ملی می توان به گزینه هایی نظیر اشتغالزایی هدفمند با پتانسیل یک هزارنفر در یکسال، چرخه اقتصادی متفاوت با هدف ایجاد گردش مالی گسترده ، ایجاد اقتصاد کلان صادراتی در گام دوم اجرایی ، تحریم شکنی در زمینه انتقال و تبادل محصول با کشور های همسایه در گام دوم ، ایجاد مرز دیجیتال ، ایجاد ارزهای دیجیتال داخلی متفاوت از نوسان حبابی ، توسعه علوم کشور در زمینه علوم روز ، هدف دهی به ساختار جامعه با علوم روز ، نیاز سنجی کشور در تمامی موارد مصرفی ، ایجاد جامعه مجازی به صورت دو بعدی و سه بعدی ، ایجاد بزرگترین بانک اطلاعاتی هوش مصنوعی در کشور و میتوان شاهکاری متفاوت از هرآنچه در حال حاضر ایجاد شده است را در گام سوم مشاهده نمایید .</p>
    `,
    content: `
    <h3>پروژه های موجود در متاورس ایران</h3>
      <p>پروژه های متفاوتی در متاورس ایران موجود است که هرکدام خروجی های خاصی برای شهروندان به ارمغان می آورد. برای مثال ساختار فروشگاه های مجازی با قابلیت دو بعدی و سه بعدی ، فروشگاه های مجهز به هوش مصنوعی با مدیریت انسان و مدیریت ربات ، دفاتر کار مجهز به ساختار کنفرانس ، سیستم های crm ، ایجاد چارت های سازمانی ، ویژگی های مکالمه صوتی و تصویری ، سیستم بایگانی و مدیریت مشتری به همراه درگاه های شخصی ، ایجاد مراکز علمی و آموزشی با هدف ترویج علوم تخصصی به صورت مجازی به منظور کاهش آلودگی ، کاهش بیماری های مسری ، کاهش هزینه های جاری و دیگر موارد . بخشی از پروژه های داخلی که در گام اول پروژه متاورس ایران شاهد آن خواهید بود.
 درخصوص هدف ایجاد شهر مجازی ایران میتوان گفت علوم و تکنولوژی روز به روز و ساعت به ساعت درحال توسعه میباشد و دراین راستا نباید عقب ماند و می بایست با علوم روز پیش رفت ، طبق تحقیقات گسترده از دنیای مجازی و شبکه سازی اطلاعات درنظر گرفته شد که ساختاری متفاوت از متاورس های خارجی برای بهبود عملکرد شهروندان کشور ایجاد و نمونه اولیه ساختار سازی دنیای موازی را متناسب با نیاز جامعه ایجاد نماییم . از نکات حائز اهمیت در ساختار فعلی کشور اشتغال هدفمند میباشد و در این زمینه مهم ترین رکن ایجاد ساختار های اشتغال آفرینی متناسب با فعالیت شهروندان و چشم انداز پروژه متارنگ درحال توسعه است . ساختار متاورس رنگ به صورتی هدف دهی شده است که در تمامی ساعات کاری تیم متخصص درحال توسعه میباشد و پروژه های توسعه ای جلوتر از ساختار اجرایی می باشد .
متاورس ساختاری هدفمند است و برای بومی سازی آن می بایست عناصر حیاتی متناسب با نیاز جامعه را درنظر گرفت و درنتیجه راهکاری برای حل مشکلات پیش رو و چشم اندازی باشکوه برای شهروندان باشد
متاورس رنگ دارای صدها ویژگی خاص میباشد و برای مثال یک ویژگی جذاب آن تاثیر آرای شهروندان بر روند توسعه ، اقتصاد در گردش و دیگر موارد است .
اهداف پروژه متاورس رنگ ایجاد بانک علمی ، پژوهشی ، اقتصادی ، فرهنگی ، توریستی و دیگر مواردی که نیاز اولیه جامعه ایرانی میباشد و در گام های بعدی پروژه افزایش حداکثری گردش مالی به منظور توسعه زیرساخت های صادرات محصولات ایرانی به دور از تحریم های استکبار.</p>

<h3>ویژگی های شهر مجازی
</h3>
<p> از ویژگی های منحصر به فرد شهر مجازی میتوان به ساختار چالش ها ، خدمات تخصصی شهروندی ، سطوح طبقه بندی ، دنیای سه بعدی ، ارزهای داخلی و موارد دیگری که هرکدام با هدف بهبود عملکرد در چرخه اقتصاد ، فرهنگ و اشتغال اشاره کرد .   کاربران میتوانند از امکاناتی که در سطوح مختلف بدست می آورند دست یابند و این ساختار به صورتی ایجاد شده است که شهروند پس از گذراندن مراحل علوم و تخصص کافی نسبت به دریافت خدمات را بدست خواهد آورد . از امکانات خاص شهر مجازی ایران ارتباط میانی با دیگر کشور ها به جهت بهبود عملکرد صادرات و مبارزه با تحریم های استکبار میباشد .
از مزیت های شهر مجازی تولید شده توسط شرکت تعاونی زنجیره تامین بهشت میتوان به سرمایه گذاری کوتاه مدت و بلند مدت اشاره کرد و از دیگر مزیت های آن ایجاد کارت های شهروندی هوشمند به جهت دریافت خدمات در لحظه به صورت زنجیره ای اشاره نمود .</p>
    `,

    // ✅ نویسنده با شناسه شهروندی
    author: {
      name: "سعید زاجکانی",
      citizenId: "HM-2000000",
      avatar: "/images/authors/marzieh.jpg",
      field: "سلامت و تکنولوژی",
      bio: "چندین پیشرفت دیگر در فناوری نیمه هادی شامل مدار مجتمع (IC)...",
      socials: {
        telegram: "https://t.me/username",
        whatsapp: "989123456789",
        email: "example@mail.com",
      },
    },

    // ✅ دسته بندی
    category: "تکنولوژی",
    subCategory: "متاورس",

    // ✅ آمار
    stats: {
      likes: 120,
      dislikes: 5,
      views: 3400,
      comments: 18,
    },
  },
  {
    id: 2,
    title: "ترجمه ماشینی چیست؟",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
  {
    id: 3,
    title: "ترجمه ماشینی چیست؟",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 1210,
      comments: 6,
    },
  },
  {
    id: 4,
    title: "ترجمه ماشینی چیست؟",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 280,
      comments: 6,
    },
  },
  {
    id: 5,
    title: "هدف از ساخت متاورس ملی چیست و چه خدماتی برای ایران و ایرانی دارد ؟",
    slug: "tt-metaverse",
    date: "2022-08-14", // میلادی برای سورت
    image: "/articles1.png",
    excerpt: " متاورس ملی اهداف زیادی از قبیل عدم خروج ارز از کشور و در فازهای بعدی ورود ارز به کشور را دارد که این ها همه بخشی کوچکی از اهداف متاورس ملی می باشد. ",
    description: ` <h2>سخن مدیرعامل</h2>
      <p>در این خصوص به بخشی از هدف و چشم انداز متاورس ملی می توان به گزینه هایی نظیر اشتغالزایی هدفمند با پتانسیل یک هزارنفر در یکسال، چرخه اقتصادی متفاوت با هدف ایجاد گردش مالی گسترده ، ایجاد اقتصاد کلان صادراتی در گام دوم اجرایی ، تحریم شکنی در زمینه انتقال و تبادل محصول با کشور های همسایه در گام دوم ، ایجاد مرز دیجیتال ، ایجاد ارزهای دیجیتال داخلی متفاوت از نوسان حبابی ، توسعه علوم کشور در زمینه علوم روز ، هدف دهی به ساختار جامعه با علوم روز ، نیاز سنجی کشور در تمامی موارد مصرفی ، ایجاد جامعه مجازی به صورت دو بعدی و سه بعدی ، ایجاد بزرگترین بانک اطلاعاتی هوش مصنوعی در کشور و میتوان شاهکاری متفاوت از هرآنچه در حال حاضر ایجاد شده است را در گام سوم مشاهده نمایید .</p>
    `,
    content: `
    <h3>پروژه های موجود در متاورس ایران</h3>
      <p>پروژه های متفاوتی در متاورس ایران موجود است که هرکدام خروجی های خاصی برای شهروندان به ارمغان می آورد. برای مثال ساختار فروشگاه های مجازی با قابلیت دو بعدی و سه بعدی ، فروشگاه های مجهز به هوش مصنوعی با مدیریت انسان و مدیریت ربات ، دفاتر کار مجهز به ساختار کنفرانس ، سیستم های crm ، ایجاد چارت های سازمانی ، ویژگی های مکالمه صوتی و تصویری ، سیستم بایگانی و مدیریت مشتری به همراه درگاه های شخصی ، ایجاد مراکز علمی و آموزشی با هدف ترویج علوم تخصصی به صورت مجازی به منظور کاهش آلودگی ، کاهش بیماری های مسری ، کاهش هزینه های جاری و دیگر موارد . بخشی از پروژه های داخلی که در گام اول پروژه متاورس ایران شاهد آن خواهید بود.
 درخصوص هدف ایجاد شهر مجازی ایران میتوان گفت علوم و تکنولوژی روز به روز و ساعت به ساعت درحال توسعه میباشد و دراین راستا نباید عقب ماند و می بایست با علوم روز پیش رفت ، طبق تحقیقات گسترده از دنیای مجازی و شبکه سازی اطلاعات درنظر گرفته شد که ساختاری متفاوت از متاورس های خارجی برای بهبود عملکرد شهروندان کشور ایجاد و نمونه اولیه ساختار سازی دنیای موازی را متناسب با نیاز جامعه ایجاد نماییم . از نکات حائز اهمیت در ساختار فعلی کشور اشتغال هدفمند میباشد و در این زمینه مهم ترین رکن ایجاد ساختار های اشتغال آفرینی متناسب با فعالیت شهروندان و چشم انداز پروژه متارنگ درحال توسعه است . ساختار متاورس رنگ به صورتی هدف دهی شده است که در تمامی ساعات کاری تیم متخصص درحال توسعه میباشد و پروژه های توسعه ای جلوتر از ساختار اجرایی می باشد .
متاورس ساختاری هدفمند است و برای بومی سازی آن می بایست عناصر حیاتی متناسب با نیاز جامعه را درنظر گرفت و درنتیجه راهکاری برای حل مشکلات پیش رو و چشم اندازی باشکوه برای شهروندان باشد
متاورس رنگ دارای صدها ویژگی خاص میباشد و برای مثال یک ویژگی جذاب آن تاثیر آرای شهروندان بر روند توسعه ، اقتصاد در گردش و دیگر موارد است .
اهداف پروژه متاورس رنگ ایجاد بانک علمی ، پژوهشی ، اقتصادی ، فرهنگی ، توریستی و دیگر مواردی که نیاز اولیه جامعه ایرانی میباشد و در گام های بعدی پروژه افزایش حداکثری گردش مالی به منظور توسعه زیرساخت های صادرات محصولات ایرانی به دور از تحریم های استکبار.</p>

<h3>ویژگی های شهر مجازی
</h3>
<p> از ویژگی های منحصر به فرد شهر مجازی میتوان به ساختار چالش ها ، خدمات تخصصی شهروندی ، سطوح طبقه بندی ، دنیای سه بعدی ، ارزهای داخلی و موارد دیگری که هرکدام با هدف بهبود عملکرد در چرخه اقتصاد ، فرهنگ و اشتغال اشاره کرد .   کاربران میتوانند از امکاناتی که در سطوح مختلف بدست می آورند دست یابند و این ساختار به صورتی ایجاد شده است که شهروند پس از گذراندن مراحل علوم و تخصص کافی نسبت به دریافت خدمات را بدست خواهد آورد . از امکانات خاص شهر مجازی ایران ارتباط میانی با دیگر کشور ها به جهت بهبود عملکرد صادرات و مبارزه با تحریم های استکبار میباشد .
از مزیت های شهر مجازی تولید شده توسط شرکت تعاونی زنجیره تامین بهشت میتوان به سرمایه گذاری کوتاه مدت و بلند مدت اشاره کرد و از دیگر مزیت های آن ایجاد کارت های شهروندی هوشمند به جهت دریافت خدمات در لحظه به صورت زنجیره ای اشاره نمود .</p>
    `,

    // ✅ نویسنده با شناسه شهروندی
    author: {
      name: "سعید زاجکانی",
      citizenId: "HM-2000000", // شناسه شهروندی
    },

    // ✅ دسته بندی
    category: "تکنولوژی",
    subCategory: "متاورس",

    // ✅ آمار
    stats: {
      likes: 120,
      dislikes: 5,
      views: 2100,
      comments: 18,
    },
  },
  {
    id: 6,
    title: "ترجمه ماشینی چیست؟",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 2880,
      comments: 6,
    },
  },
  {
    id: 7,
    title: "ترجمه ماشینی چیست؟",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 1880,
      comments: 6,
    },
  },
  {
    id: 6,
    title: "ترجمه ماشینی چیست؟",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 2880,
      comments: 6,
    },
  },
  {
    id: 8,
    title: " ماشین لرنینگ چیست؟",
    slug: "machine-learning",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: " ماشین لرنینگ ",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 1880,
      comments: 6,
    },
  },
];

