
export const articles = [
  {
    id: 1,
    title: "هدف از ساخت متاورس ملی چیست و چه خدماتی برای ایران و ایرانی دارد ؟",
    slug: "national-metaverse1",
    date: "2022-08-14", // میلادی برای سورت
    image: "/articles/articles2.png",
    excerpt: " متاورس ملی اهداف زیادی از قبیل عدم خروج ارز از کشور و در فازهای بعدی ورود ارز به کشور را دارد که این ها همه بخشی کوچکی از اهداف متاورس ملی می باشد. ",
    description: ` <h2>سخن مدیرعامل</h2>
      <p>در این خصوص به بخشی از هدف و چشم انداز متاورس ملی می توان به گزینه هایی نظیر اشتغالزایی هدفمند با پتانسیل یک هزارنفر در یکسال، چرخه اقتصادی متفاوت با هدف ایجاد گردش مالی گسترده ، ایجاد اقتصاد کلان صادراتی در گام دوم اجرایی ، تحریم شکنی در زمینه انتقال و تبادل محصول با کشور های همسایه در گام دوم ، ایجاد مرز دیجیتال ، ایجاد ارزهای دیجیتال داخلی متفاوت از نوسان حبابی ، توسعه علوم کشور در زمینه علوم روز ، هدف دهی به ساختار جامعه با علوم روز ، نیاز سنجی کشور در تمامی موارد مصرفی ، ایجاد جامعه مجازی به صورت دو بعدی و سه بعدی ، ایجاد بزرگترین بانک اطلاعاتی هوش مصنوعی در کشور و میتوان شاهکاری متفاوت از هرآنچه در حال حاضر ایجاد شده است را در گام سوم مشاهده نمایید .</p>
    `,
    content: `
    <h3>پروژه های موجود در متاورس ایران</h3>
      <p>پروژه های متفاوتی در متاورس ایران موجود است که هرکدام خروجی های خاصی برای شهروندان به ارمغان می آورد. برای مثال ساختار فروشگاه های مجازی با قابلیت دو بعدی و سه بعدی ، فروشگاه های مجهز به هوش مصنوعی با مدیریت انسان و مدیریت ربات ، دفاتر کار مجهز به ساختار کنفرانس ، سیستم های crm ، ایجاد چارت های سازمانی ، ویژگی های مکالمه صوتی و تصویری ، سیستم بایگانی و مدیریت مشتری به همراه درگاه های شخصی ، ایجاد مراکز علمی و آموزشی با هدف ترویج علوم تخصصی به صورت مجازی به منظور کاهش آلودگی ، کاهش بیماری های مسری ، کاهش هزینه های جاری و دیگر موارد . بخشی از پروژه های داخلی که در گام اول پروژه متاورس ایران شاهد آن خواهید بود.
 درخصوص هدف ایجاد شهر مجازی ایران میتوان گفت علوم و تکنولوژی روز به روز و ساعت به ساعت درحال توسعه میباشد و دراین راستا نباید عقب ماند و می بایست با علوم روز پیش رفت ، طبق تحقیقات گسترده از دنیای مجازی و شبکه سازی اطلاعات درنظر گرفته شد که ساختاری متفاوت از متاورس های خارجی برای بهبود عملکرد شهروندان کشور ایجاد و نمونه اولیه ساختار سازی دنیای موازی را متناسب با نیاز جامعه ایجاد نماییم . از نکات حائز اهمیت در ساختار فعلی کشور اشتغال هدفمند میباشد و در این زمینه مهم ترین رکن ایجاد ساختار های اشتغال آفرینی متناسب با فعالیت شهروندان و چشم انداز پروژه متارنگ درحال توسعه است . ساختار متاورس رنگ به صورتی هدف دهی شده است که در تمامی ساعات کاری تیم متخصص درحال توسعه میباشد و پروژه های توسعه ای جلوتر از ساختار اجرایی می باشد .
متاورس ساختاری هدفمند است و برای بومی سازی آن می بایست عناصر حیاتی متناسب با نیاز جامعه را درنظر گرفت و درنتیجه راهکاری برای حل مشکلات پیش رو و چشم اندازی باشکوه برای شهروندان باشد
متاورس رنگ دارای صدها ویژگی خاص میباشد و برای مثال یک ویژگی جذاب آن تاثیر آرای شهروندان بر روند توسعه ، اقتصاد در گردش و دیگر موارد است .
اهداف پروژه متاورس رنگ ایجاد بانک علمی ، پژوهشی ، اقتصادی ، فرهنگی ، توریستی و دیگر مواردی که نیاز اولیه جامعه ایرانی میباشد و در گام های بعدی پروژه افزایش حداکثری گردش مالی به منظور توسعه زیرساخت های صادرات محصولات ایرانی به دور از تحریم های استکبار.</p>

<h3>ویژگی های شهر مجازی
</h3>
<p> از ویژگی های منحصر به فرد شهر مجازی میتوان به ساختار چالش ها ، خدمات تخصصی شهروندی ، سطوح طبقه بندی ، دنیای سه بعدی ، ارزهای داخلی و موارد دیگری که هرکدام با هدف بهبود عملکرد در چرخه اقتصاد ، فرهنگ و اشتغال اشاره کرد .   کاربران میتوانند از امکاناتی که در سطوح مختلف بدست می آورند دست یابند و این ساختار به صورتی ایجاد شده است که شهروند پس از گذراندن مراحل علوم و تخصص کافی نسبت به دریافت خدمات را بدست خواهد آورد . از امکانات خاص شهر مجازی ایران ارتباط میانی با دیگر کشور ها به جهت بهبود عملکرد صادرات و مبارزه با تحریم های استکبار میباشد .
از مزیت های شهر مجازی تولید شده توسط شرکت تعاونی زنجیره تامین بهشت میتوان به سرمایه گذاری کوتاه مدت و بلند مدت اشاره کرد و از دیگر مزیت های آن ایجاد کارت های شهروندی هوشمند به جهت دریافت خدمات در لحظه به صورت زنجیره ای اشاره نمود .</p>
<p>نیاز سنجی کشور
شرایط عمومی و نیازهای یک کشور در طول زمان دچار تغییر و تحول شده و همواره باید مطابق با آن مساله تامین در جامعه عینیت یابد . بر همین اساس در متاورس ملی به شکل مداوم و با اتکا به هوش مصنوعی می توان از نیازهای روز و ضروری جامعه مطلع و در موقع لازم برنامه های راهبردی برای آن اعمال گردد . این نیازسنجی اولا کشور را از مصرف گرایی کاذب رها ساخته و ثانیا در بحث صادرات نیز می تواند یاریگر کشور باشد به این شکل که مطابق با تقاضا و نیاز جوامع جهانی صادرات در بخش های مختلف می تواند افزایش و یا کاهش یابد . و این می تواند برگ برنده ی تجار ایرانی در تجارت و صادرات نیز باشد .

ایجاد جامعه مجازی به صورت دو بعدی و سه بعدی
جامعه وسعت بزرگی از یک زندگی اجتماعی انسان است و در درون خود لایه های بسیاری زیادی دارد که هر لایه آن دارای هزاران شاخه می باشد . اما به طور کل جامعه محل اجتماع انسانهاست و در این محل اجتماع هر کنش و واکنشی تبعات و اثرات مثبت و منفی بر اهالی آن جامعه خواهد داشت . بنابراین متاورس ملی سعی برآن دارد تا جامعه مجازی را تشکیل دهد که در آن شهروندان با قوانین و هنجارهایی که توسط خود شان به تصویب رسیده در این دنیای موازی فعالیت خواهند نمود و این جامعه ای ست که مبنا و اساس آن بر پایه رضایت قرار داده شده است و به طبع رضایت در صورت بهبود ایجاد می شود و نهایتا این عملکرد است که در جامعه مجازی متاورس ملی تجلی می یابد و بهبود این عملکرد رضایت را و رضایت یک جامعه مورد قبول همگان را ایجاد می نمایند .

ایجاد بزرگترین بانک اطلاعاتی هوش مصنوعی در کشور
سیر جهان به سمتی ست که اطلاعات و دانش انسان را برای بازدهی بیشتر به ربات و کامپیوتر می سپارند تا انسان وقت بیشتری برای کشف و ورود به دنیاهای ناشناخته تر جهان آفرینش داشته باشد . و این روند در پدیده ای به نام هوش مصنوعی جمع می گردد با این هدف که ساختاری منظم خستگی ناپذیر کم اشتباه وپرکاربرد را برای استفاده انسان آماده نماید . بنابراین در  متاورس ملی برای اولین بار در ایران نخستین هوش مصنوعی بومی ساخته و پرداخته شده تا نظم نوینی را در بستر دنیای موازی برای شهروندان آن ایجاد نماید . 
ساختاری متفاوت از متاورس های خارجی برای بهبود عملکرد شهروندان کشور
آنچه در متاورس های بیگانه پیش روی کاربران قرار دارد سرزمینی برای کسب ثروت از قواعدی ست که لایه های پنهان و پشت پرده بسیار دارد و سیاست های گردانندگان آن تعیین کننده سرنوشت درآمد کاربران از این متاورس ها می باشد . در عین حال که در نمونه های شهر مجازی متاورسی بیگانه با نظام شهری روبه رو هستیم که گویی حیات خلوت فعالیت های هنجارشکنانه و مجرمانه می باشد و میل و شوق به آزادی بی حد و حصر در این متاورس ها آنها را به هرج و مرج کشانده است .
در حالی که آنچه مضمن یک آبادانی مداوم است سرمایه گذاری بر روی شهروندان آن وادی است .بهبود عملکرد شهروندان در مشاغل آموزش فرهنگ روابط اجتماعی و... از جمله سرمایه های بلندمدتی ست که می تواند آینده آباد یک شهر را تضمین نماید و متاورس ملی با چنین برنامه ای سعی بر آن دارد تا با استفاده از تمامی ظرفیت های موجود در کشور بیشترین کارایی را خروجی گرفته و در نهایت ساز و کاری را راه اندازی نماید که بهبود عملکرد شهروندان و خدمت رسانی در وظایف محوله کاری شان همواره رو به بهبود و افزایش بازدهی قرار بگیرد .
چراکه متاورس ملی یک سراب پوچ از رویای ثروتمند شدن برای هیچ کس نمی سازد تا مانند متاورس های بیگانه با نمایشی پرزرق و برق از یک آینده وهم آلود آنها را درگیر دنیای خود کرده و از سرمایه انها بهره کشی نماید بلکه گسترش فرهنگ خدمت نه در شعار بلکه به شکل قواعد بازی برای شهروندان درآمده است و به عبارت دیگر هرکس خدمتی کند سودی خواهد برد .
نیاز سنجی کشور
شرایط عمومی و نیازهای یک کشور در طول زمان دچار تغییر و تحول شده و همواره باید مطابق با آن مساله تامین در جامعه عینیت یابد . بر همین اساس در متاورس ملی به شکل مداوم و با اتکا به هوش مصنوعی می توان از نیازهای روز و ضروری جامعه مطلع و در موقع لازم برنامه های راهبردی برای آن اعمال گردد . این نیازسنجی اولا کشور را از مصرف گرایی کاذب رها ساخته و ثانیا در بحث صادرات نیز می تواند یاریگر کشور باشد به این شکل که مطابق با تقاضا و نیاز جوامع جهانی صادرات در بخش های مختلف می تواند افزایش و یا کاهش یابد . و این می تواند برگ برنده ی تجار ایرانی در تجارت و صادرات نیز باشد .

ایجاد جامعه مجازی به صورت دو بعدی و سه بعدی
جامعه وسعت بزرگی از یک زندگی اجتماعی انسان است و در درون خود لایه های بسیاری زیادی دارد که هر لایه آن دارای هزاران شاخه می باشد . اما به طور کل جامعه محل اجتماع انسانهاست و در این محل اجتماع هر کنش و واکنشی تبعات و اثرات مثبت و منفی بر اهالی آن جامعه خواهد داشت . بنابراین متاورس ملی سعی برآن دارد تا جامعه مجازی را تشکیل دهد که در آن شهروندان با قوانین و هنجارهایی که توسط خود شان به تصویب رسیده در این دنیای موازی فعالیت خواهند نمود و این جامعه ای ست که مبنا و اساس آن بر پایه رضایت قرار داده شده است و به طبع رضایت در صورت بهبود ایجاد می شود و نهایتا این عملکرد است که در جامعه مجازی متاورس ملی تجلی می یابد و بهبود این عملکرد رضایت را و رضایت یک جامعه مورد قبول همگان را ایجاد می نمایند .

ایجاد بزرگترین بانک اطلاعاتی هوش مصنوعی در کشور
سیر جهان به سمتی ست که اطلاعات و دانش انسان را برای بازدهی بیشتر به ربات و کامپیوتر می سپارند تا انسان وقت بیشتری برای کشف و ورود به دنیاهای ناشناخته تر جهان آفرینش داشته باشد . و این روند در پدیده ای به نام هوش مصنوعی جمع می گردد با این هدف که ساختاری منظم خستگی ناپذیر کم اشتباه وپرکاربرد را برای استفاده انسان آماده نماید . بنابراین در  متاورس ملی برای اولین بار در ایران نخستین هوش مصنوعی بومی ساخته و پرداخته شده تا نظم نوینی را در بستر دنیای موازی برای شهروندان آن ایجاد نماید . 
ساختاری متفاوت از متاورس های خارجی برای بهبود عملکرد شهروندان کشور
آنچه در متاورس های بیگانه پیش روی کاربران قرار دارد سرزمینی برای کسب ثروت از قواعدی ست که لایه های پنهان و پشت پرده بسیار دارد و سیاست های گردانندگان آن تعیین کننده سرنوشت درآمد کاربران از این متاورس ها می باشد . در عین حال که در نمونه های شهر مجازی متاورسی بیگانه با نظام شهری روبه رو هستیم که گویی حیات خلوت فعالیت های هنجارشکنانه و مجرمانه می باشد و میل و شوق به آزادی بی حد و حصر در این متاورس ها آنها را به هرج و مرج کشانده است .
در حالی که آنچه مضمن یک آبادانی مداوم است سرمایه گذاری بر روی شهروندان آن وادی است .بهبود عملکرد شهروندان در مشاغل آموزش فرهنگ روابط اجتماعی و... از جمله سرمایه های بلندمدتی ست که می تواند آینده آباد یک شهر را تضمین نماید و متاورس ملی با چنین برنامه ای سعی بر آن دارد تا با استفاده از تمامی ظرفیت های موجود در کشور بیشترین کارایی را خروجی گرفته و در نهایت ساز و کاری را راه اندازی نماید که بهبود عملکرد شهروندان و خدمت رسانی در وظایف محوله کاری شان همواره رو به بهبود و افزایش بازدهی قرار بگیرد .
چراکه متاورس ملی یک سراب پوچ از رویای ثروتمند شدن برای هیچ کس نمی سازد تا مانند متاورس های بیگانه با نمایشی پرزرق و برق از یک آینده وهم آلود آنها را درگیر دنیای خود کرده و از سرمایه انها بهره کشی نماید بلکه گسترش فرهنگ خدمت نه در شعار بلکه به شکل قواعد بازی برای شهروندان درآمده است و به عبارت دیگر هرکس خدمتی کند سودی خواهد برد .
نیاز سنجی کشور
شرایط عمومی و نیازهای یک کشور در طول زمان دچار تغییر و تحول شده و همواره باید مطابق با آن مساله تامین در جامعه عینیت یابد . بر همین اساس در متاورس ملی به شکل مداوم و با اتکا به هوش مصنوعی می توان از نیازهای روز و ضروری جامعه مطلع و در موقع لازم برنامه های راهبردی برای آن اعمال گردد . این نیازسنجی اولا کشور را از مصرف گرایی کاذب رها ساخته و ثانیا در بحث صادرات نیز می تواند یاریگر کشور باشد به این شکل که مطابق با تقاضا و نیاز جوامع جهانی صادرات در بخش های مختلف می تواند افزایش و یا کاهش یابد . و این می تواند برگ برنده ی تجار ایرانی در تجارت و صادرات نیز باشد .

ایجاد جامعه مجازی به صورت دو بعدی و سه بعدی
جامعه وسعت بزرگی از یک زندگی اجتماعی انسان است و در درون خود لایه های بسیاری زیادی دارد که هر لایه آن دارای هزاران شاخه می باشد . اما به طور کل جامعه محل اجتماع انسانهاست و در این محل اجتماع هر کنش و واکنشی تبعات و اثرات مثبت و منفی بر اهالی آن جامعه خواهد داشت . بنابراین متاورس ملی سعی برآن دارد تا جامعه مجازی را تشکیل دهد که در آن شهروندان با قوانین و هنجارهایی که توسط خود شان به تصویب رسیده در این دنیای موازی فعالیت خواهند نمود و این جامعه ای ست که مبنا و اساس آن بر پایه رضایت قرار داده شده است و به طبع رضایت در صورت بهبود ایجاد می شود و نهایتا این عملکرد است که در جامعه مجازی متاورس ملی تجلی می یابد و بهبود این عملکرد رضایت را و رضایت یک جامعه مورد قبول همگان را ایجاد می نمایند .

ایجاد بزرگترین بانک اطلاعاتی هوش مصنوعی در کشور
سیر جهان به سمتی ست که اطلاعات و دانش انسان را برای بازدهی بیشتر به ربات و کامپیوتر می سپارند تا انسان وقت بیشتری برای کشف و ورود به دنیاهای ناشناخته تر جهان آفرینش داشته باشد . و این روند در پدیده ای به نام هوش مصنوعی جمع می گردد با این هدف که ساختاری منظم خستگی ناپذیر کم اشتباه وپرکاربرد را برای استفاده انسان آماده نماید . بنابراین در  متاورس ملی برای اولین بار در ایران نخستین هوش مصنوعی بومی ساخته و پرداخته شده تا نظم نوینی را در بستر دنیای موازی برای شهروندان آن ایجاد نماید . 
ساختاری متفاوت از متاورس های خارجی برای بهبود عملکرد شهروندان کشور
آنچه در متاورس های بیگانه پیش روی کاربران قرار دارد سرزمینی برای کسب ثروت از قواعدی ست که لایه های پنهان و پشت پرده بسیار دارد و سیاست های گردانندگان آن تعیین کننده سرنوشت درآمد کاربران از این متاورس ها می باشد . در عین حال که در نمونه های شهر مجازی متاورسی بیگانه با نظام شهری روبه رو هستیم که گویی حیات خلوت فعالیت های هنجارشکنانه و مجرمانه می باشد و میل و شوق به آزادی بی حد و حصر در این متاورس ها آنها را به هرج و مرج کشانده است .
در حالی که آنچه مضمن یک آبادانی مداوم است سرمایه گذاری بر روی شهروندان آن وادی است .بهبود عملکرد شهروندان در مشاغل آموزش فرهنگ روابط اجتماعی و... از جمله سرمایه های بلندمدتی ست که می تواند آینده آباد یک شهر را تضمین نماید و متاورس ملی با چنین برنامه ای سعی بر آن دارد تا با استفاده از تمامی ظرفیت های موجود در کشور بیشترین کارایی را خروجی گرفته و در نهایت ساز و کاری را راه اندازی نماید که بهبود عملکرد شهروندان و خدمت رسانی در وظایف محوله کاری شان همواره رو به بهبود و افزایش بازدهی قرار بگیرد .
چراکه متاورس ملی یک سراب پوچ از رویای ثروتمند شدن برای هیچ کس نمی سازد تا مانند متاورس های بیگانه با نمایشی پرزرق و برق از یک آینده وهم آلود آنها را درگیر دنیای خود کرده و از سرمایه انها بهره کشی نماید بلکه گسترش فرهنگ خدمت نه در شعار بلکه به شکل قواعد بازی برای شهروندان درآمده است و به عبارت دیگر هرکس خدمتی کند سودی خواهد برد .
</p>
    `,

    author: {
      name: "سعید زاجکانی",
      citizenId: "HM-2000000",
      avatar: "/articles/author/authorTest.jpg",
      field: "سلامت و تکنولوژی",
      bio: "چندین پیشرفت دیگر در فناوری نیمه هادی شامل مدار مجتمع (IC)...",
      socials: {
        telegram: "https://t.me/username",
        whatsapp: "989123456789",
        email: "example@mail.com",
      },
    },

    category: "نوسعه وب",
    subCategory: "ریکت",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطر آن چنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می‌باشد.",

    tags: [
      { label: "متاورس", slug: "metaverse" },
      { label: "تکنولوژی", slug: "technology" },
      { label: "ایران", slug: "iran" },
    ],


    stats: {
      likes: 120,
      dislikes: 5,
      views: 3400,
      comments: 18,
    },
  },
  {
    id: 2,
    title: "  ریکت چیست ؟",
    slug: "test001",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd ",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
  {
    id: 3,
    title: " 2ترجمه ماشینی چیست؟",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "222بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "سیبس بس یبس یبس یب سیبچخحصهنضشثحجخقهضش حجصخثیبجحخشسیتبنل حشستیبمکن شستیمکنبتشسمکین بتشجحسیهتبمک هشستیبمکنشتسیبشسیب شسیبتس یخحهبعت سثخحهیباتشحمیهسن بتشسجخحهیهبغاصحخهث تاشسخیمکهبلا شسحخعهیبعاکشسخهیبات شخحهسیا شحکنسیبت شحخجهسیباتف    بسیگنيخشجسني جخحشسني شخحجسينشحخجسني حشجسخني شسحخني شجحسنخحجلتاخحهصسعتثفبت شحخجهسیباتف    بسیگنيخشجسني جخحشسني شخحجسينشحخجسني حشجسخني شسحخني شجحسنخحجلتاخحهصسعتثفبت شحخجهسیباتف    بسیگنيخشجسني جخحشسني شخحجسينشحخجسني حشجسخني شسحخني شجحسنخحجلتاخحهصسعتثفبت شحخجهسیباتف    بسیگنيخشجسني جخحشسني شخحجسينشحخجسني حشجسخني شسحخني شجحسنخحجلتاخحهصسعتثفبت شحخجهسیباتف    بسیگنيخشجسني جخحشسني شخحجسينشحخجسني حشجسخني شسحخني شجحسنخحجلتاخحهصسعتثفبت شحخجهسیباتف    بسیگنيخشجسني جخحشسني شخحجسينشحخجسني حشجسخني شسحخني شجحسنخحجلتاخحهصسعتثف لحخجهيبتذ   يبد لاخحه سبتلحسيب لجشحهنسبدل",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 1210,
      comments: 6,
    },
  },
  {
    id: 4,
    title: "ترجمه ماشینی چیست؟3333",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...33333",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "سیبس بس یبس یبس یب سیبچخحصهنضشثحجخقهضش حجصخثیبجحخشسیتبنل حشستیبمکن شستیمکنبتشسمکین بتشجحسیهتبمک هشستیبمکنشتسیبشسیب شسیبتس یخحهبعت سثخحهیباتشحمیهسن بتشسجخحهیهبغاصحخهث تاشسخیمکهبلا شسحخعهیبعاکشسخهیبات شخحهسیا شحکنسیبت شحخجهسیباتف لجشحهنسبدل",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 280,
      comments: 6,
    },
  },
  {
    id: 5,
    title: "هدف از ساخت متاورس ملی چیست و چه خدماتی برای ایران و ایرانی دارد ؟",
    slug: "tt-metaverse",
    date: "2022-08-14", // میلادی برای سورت
    image: "/clogo.png",
    excerpt: " متاورس ملی اهداف زیادی از قبیل عدم خروج ارز از کشور و در فازهای بعدی ورود ارز به کشور را دارد که این ها همه بخشی کوچکی از اهداف متاورس ملی می باشد. ",
    description: ` <h2>سخن مدیرعامل</h2>
      <p>در این خصوص به بخشی از هدف و چشم انداز متاورس ملی می توان به گزینه هایی نظیر اشتغالزایی هدفمند با پتانسیل یک هزارنفر در یکسال، چرخه اقتصادی متفاوت با هدف ایجاد گردش مالی گسترده ، ایجاد اقتصاد کلان صادراتی در گام دوم اجرایی ، تحریم شکنی در زمینه انتقال و تبادل محصول با کشور های همسایه در گام دوم ، ایجاد مرز دیجیتال ، ایجاد ارزهای دیجیتال داخلی متفاوت از نوسان حبابی ، توسعه علوم کشور در زمینه علوم روز ، هدف دهی به ساختار جامعه با علوم روز ، نیاز سنجی کشور در تمامی موارد مصرفی ، ایجاد جامعه مجازی به صورت دو بعدی و سه بعدی ، ایجاد بزرگترین بانک اطلاعاتی هوش مصنوعی در کشور و میتوان شاهکاری متفاوت از هرآنچه در حال حاضر ایجاد شده است را در گام سوم مشاهده نمایید .</p>
    `,
    content: `
    <h3>پروژه های موجود در متاورس ایران</h3>
      <p>پروژه های متفاوتی در متاورس ایران موجود است که هرکدام خروجی های خاصی برای شهروندان به ارمغان می آورد. برای مثال ساختار فروشگاه های مجازی با قابلیت دو بعدی و سه بعدی ، فروشگاه های مجهز به هوش مصنوعی با مدیریت انسان و مدیریت ربات ، دفاتر کار مجهز به ساختار کنفرانس ، سیستم های crm ، ایجاد چارت های سازمانی ، ویژگی های مکالمه صوتی و تصویری ، سیستم بایگانی و مدیریت مشتری به همراه درگاه های شخصی ، ایجاد مراکز علمی و آموزشی با هدف ترویج علوم تخصصی به صورت مجازی به منظور کاهش آلودگی ، کاهش بیماری های مسری ، کاهش هزینه های جاری و دیگر موارد . بخشی از پروژه های داخلی که در گام اول پروژه متاورس ایران شاهد آن خواهید بود.
 درخصوص هدف ایجاد شهر مجازی ایران میتوان گفت علوم و تکنولوژی روز به روز و ساعت به ساعت درحال توسعه میباشد و دراین راستا نباید عقب ماند و می بایست با علوم روز پیش رفت ، طبق تحقیقات گسترده از دنیای مجازی و شبکه سازی اطلاعات درنظر گرفته شد که ساختاری متفاوت از متاورس های خارجی برای بهبود عملکرد شهروندان کشور ایجاد و نمونه اولیه ساختار سازی دنیای موازی را متناسب با نیاز جامعه ایجاد نماییم . از نکات حائز اهمیت در ساختار فعلی کشور اشتغال هدفمند میباشد و در این زمینه مهم ترین رکن ایجاد ساختار های اشتغال آفرینی متناسب با فعالیت شهروندان و چشم انداز پروژه متارنگ درحال توسعه است . ساختار متاورس رنگ به صورتی هدف دهی شده است که در تمامی ساعات کاری تیم متخصص درحال توسعه میباشد و پروژه های توسعه ای جلوتر از ساختار اجرایی می باشد .
متاورس ساختاری هدفمند است و برای بومی سازی آن می بایست عناصر حیاتی متناسب با نیاز جامعه را درنظر گرفت و درنتیجه راهکاری برای حل مشکلات پیش رو و چشم اندازی باشکوه برای شهروندان باشد
متاورس رنگ دارای صدها ویژگی خاص میباشد و برای مثال یک ویژگی جذاب آن تاثیر آرای شهروندان بر روند توسعه ، اقتصاد در گردش و دیگر موارد است .
اهداف پروژه متاورس رنگ ایجاد بانک علمی ، پژوهشی ، اقتصادی ، فرهنگی ، توریستی و دیگر مواردی که نیاز اولیه جامعه ایرانی میباشد و در گام های بعدی پروژه افزایش حداکثری گردش مالی به منظور توسعه زیرساخت های صادرات محصولات ایرانی به دور از تحریم های استکبار.</p>

<h3>ویژگی های شهر مجازی
</h3>
<p> از ویژگی های منحصر به فرد شهر مجازی میتوان به ساختار چالش ها ، خدمات تخصصی شهروندی ، سطوح طبقه بندی ، دنیای سه بعدی ، ارزهای داخلی و موارد دیگری که هرکدام با هدف بهبود عملکرد در چرخه اقتصاد ، فرهنگ و اشتغال اشاره کرد .   کاربران میتوانند از امکاناتی که در سطوح مختلف بدست می آورند دست یابند و این ساختار به صورتی ایجاد شده است که شهروند پس از گذراندن مراحل علوم و تخصص کافی نسبت به دریافت خدمات را بدست خواهد آورد . از امکانات خاص شهر مجازی ایران ارتباط میانی با دیگر کشور ها به جهت بهبود عملکرد صادرات و مبارزه با تحریم های استکبار میباشد .
از مزیت های شهر مجازی تولید شده توسط شرکت تعاونی زنجیره تامین بهشت میتوان به سرمایه گذاری کوتاه مدت و بلند مدت اشاره کرد و از دیگر مزیت های آن ایجاد کارت های شهروندی هوشمند به جهت دریافت خدمات در لحظه به صورت زنجیره ای اشاره نمود .</p>
    `,

    // ✅ نویسنده با شناسه شهروندی
    author: {
      name: "سعید زاجکانی",
      citizenId: "HM-2000000", // شناسه شهروندی
    },

    // ✅ دسته بندی
    category: "تکنولوژی",
    subCategory: "متاورس",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd ",

    // ✅ آمار
    stats: {
      likes: 120,
      dislikes: 5,
      views: 2100,
      comments: 18,
    },
  },
  {
    id: 9,
    title: "ترجمه ماشینی 4444444",
    slug: "machine-232323",
    date: "2025-06-22",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...44444444",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش تصویر",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "سیبس بس یبس یبس یب سیبچخحصهنضشثحجخقهضش حجصخثیبجحخشسیتبنل حشستیبمکن شستیمکنبتشسمکین بتشجحسیهتبمک هشستیبمکنشتسیبشسیب شسیبتس یخحهبعت سثخحهیباتشحمیهسن بتشسجخحهیهبغاصحخهث تاشسخیمکهبلا شسحخعهیبعاکشسخهیبات شخحهسیا شحکنسیبت شحخجهسیباتف لجشحهنسبدل",
    stats: {
      likes: 45,
      dislikes: 2,
      views: 1880,
      comments: 6,
    },
  },
  {
    id: 7,
    title: "ترجمه ماشینی چیست؟555",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...5555",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 1880,
      comments: 6,
    },
  },
  {
    id: 6,
    title: "ترجمه ماشینی چیست؟6666666",
    slug: "machine-translation",
    date: "2025-06-30",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...666666",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: "پردازش زبان طبیعی",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 2880,
      comments: 6,
    },
  },
  {
    id: 8,
    title: " ماشین لرنینگ چیست؟7777777777",
    slug: "machine-learning",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...77777777",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "HM-2000000",
    },

    category: "هوش مصنوعی",
    subCategory: " ماشین لرنینگ ",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 1880,
      comments: 6,
    },
  },
  {
    id: 9,
    title: "  NEXT.JS چیست ؟",
    slug: "next_js",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd  sfdf sdf sdf sdf sdf sdf' lkwse'lr kfwq['eofk w[]eoifk wp[]eofikwp[oerfgk ['sofgk[p d skajgp[dsfjg [psdfjgopi sdf",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
  {
    id: 9,
    title: "  NEXT.JS چیست ؟",
    slug: "next_js",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب2",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd  sfdf sdf sdf sdf sdf sdf' lkwse'lr kfwq['eofk w[]eoifk wp[]eofikwp[oerfgk ['sofgk[p d skajgp[dsfjg [psdfjgopi sdf",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
  {
    id: 9,
    title: "  NEXT.JS چیست ؟",
    slug: "next_js",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب3",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd  sfdf sdf sdf sdf sdf sdf' lkwse'lr kfwq['eofk w[]eoifk wp[]eofikwp[oerfgk ['sofgk[p d skajgp[dsfjg [psdfjgopi sdf",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
  {
    id: 9,
    title: "  NEXT.JS چیست ؟",
    slug: "next_js",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب4",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd  sfdf sdf sdf sdf sdf sdf' lkwse'lr kfwq['eofk w[]eoifk wp[]eofikwp[oerfgk ['sofgk[p d skajgp[dsfjg [psdfjgopi sdf",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
  {
    id: 9,
    title: "  NEXT.JS چیست ؟",
    slug: "next_js",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب5",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd  sfdf sdf sdf sdf sdf sdf' lkwse'lr kfwq['eofk w[]eoifk wp[]eofikwp[oerfgk ['sofgk[p d skajgp[dsfjg [psdfjgopi sdf",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
  {
    id: 9,
    title: "  NEXT.JS چیست ؟",
    slug: "next_js",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd  sfdf sdf sdf sdf sdf sdf' lkwse'lr kfwq['eofk w[]eoifk wp[]eofikwp[oerfgk ['sofgk[p d skajgp[dsfjg [psdfjgopi sdf",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  }, {
    id: 9,
    title: "  NEXT.JS چیست ؟",
    slug: "next_js",
    date: "2025-01-10",
    image: "/rafiki-dark.png",
    excerpt: "بررسی مفهوم ترجمه ماشینی و کاربردهای آن در ارتباطات...",
    description: "این یک توضیح کوتاه درباره مقاله تستی است.",
    content: `
      <p>ترجمه ماشینی یکی از حوزه‌های مهم پردازش زبان طبیعی است و به کمک الگوریتم‌ها
      <a href="#">و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.<a/> و هوش مصنوعی تلاش می‌کند متن‌ها را به زبان‌های مختلف ترجمه کند.</p>
      
    `,

    author: {
      name: "شهره فاطمی علیرضاده",
      citizenId: "CIT-987654",
    },

    category: "نوسعه وب66",
    subCategory: "NEXT.JS",
    categoryImage: "/ARTICTEST.png",
    categoryDec: "test asda sdasd  sfdf sdf sdf sdf sdf sdf' lkwse'lr kfwq['eofk w[]eoifk wp[]eofikwp[oerfgk ['sofgk[p d skajgp[dsfjg [psdfjgopi sdf",

    stats: {
      likes: 45,
      dislikes: 2,
      views: 880,
      comments: 6,
    },
  },
];

