
export  const Items = [
  {
    id: 1,
    title: "دارایی (در حال توسعه)",
    hello: "با سلام به دنیای دارایی شهروندان! 🌟",
    desc: "اینجا یک نگاه سریع به آینده دارایی‌هاست، این صفحه در حال توسعه و پرورش است تا به شما اطلاعات جذاب و کاربردی در مورد دارایی‌های شگفت‌انگیز شهروندان متاورس ارائه دهد.",
    subtitleItems: "چه چیزهایی در اینجا پیدا می‌کنید؟",
    subItems: [
      {
        id: 1,
        name: "✨ واحد رضایت",
        desc: "بیشتر از یک عدد، این واحد یک دارایی بسیار ارزشمند است که قابلیت خرید و فروش ندارد و تنها توسط مالک دارایی قابلیت کرایه دارد .",
      },
      {
        id: 2,
        name: "ارز ریال ,(PSC):",
        desc: " بررسی ارزهای معاملاتی از زاویه‌های مختلف و نمایش آخرین تغییرات.",
      },
      {
        id: 3,
        name: "🌈 رنگ زرد، قرمز، و آبی",
        desc: "از جذابیت و تنوع رنگهای متاورس لذت ببرید. اینجا مکانی است که رنگهای مختلف، هر کدام داستان خود را دارند!",
      },
      {
        id: 4,
        name: "📈 واحد حد تاثیر",
        desc: "بررسی و تحلیل تأثیرات مهم تصمیم‌گیری‌ها بر دارایی‌ها.",
      },
    ],
    time: [
      {
        id: 1,
        title: "چه زمانی آماده می‌شود؟",
        desc: "متاسفانه هنوز کامل نشده‌ایم! 😅 اما ایمان داشته باشید که تیم ما با سرعت ورزیده بر روی آپگرید این صفحه کار می‌کند. بزودی اینجا برای شما شهروندان متاورس فعال خواهد شد.",
      },
    ],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "شما هم جزء خانواده ما هستید! اگر سوالات یا پیشنهاداتی دارید، با ما در ارتباط باشید. تا آن زمان، با ما همراه باشید و شاهد پیشرفت‌های ما باشید.",
      },
    ],
    end1: "",
    end2: "همیشه در حال بهبود بخشیدن به تجربه‌ی شما،",
    end3: "تیم متاورس 🚀",
  },

  {
    id: 2,
    title: "املاک (در حال توسعه)",
    hello: "با سلام به دنیایی از املاک شهروندان! 🏠✨",
    desc: "در اینجا، ما در حال ایجاد یک تجربه‌ی منحصر به فرد برای شما هستیم. صفحه املاک در حال توسعه است و به زودی به یک مرجع جامع برای اطلاعات املاک شهروندان متاورس تبدیل می‌شود.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "🏞 طبقه‌بندی بر اساس کاربری: ",
        desc: "املاک بر اساس کاربری‌های متنوع گردشگری، پارک، مراکز بهداشتی، فرهنگی، آموزشی، تجاری، نمایشگاه ، مسکونی و دیگر کاربری ها دسته‌بندی شده‌اند. هر دسته اطلاعات جامعی را ارائه می‌دهد.",
      },
      {
        id: 2,
        title: "🗺 نقشه تعاملی: ",
        desc: "یک نقشه تعاملی مانند گوگل مپ وجود دارد که املاک را بر اساس موقعیت جغرافیایی نمایش می‌دهد. با یک نگاه سریع، می‌توانید امکانات و کاربردهای هر ملک را بفهمید.",
      },
      {
        id: 3,
        title: "📈 نمودار تاریخچه",
        desc: ": اینجا یک نمودار داریم که متناسب با تاریخ مشخص شده، جزئیاتی درباره املاک خریداری شده توسط شهروند را نشان می‌دهد. از این طریق می‌توانید مسیر توسعه املاک شهروند را دنبال کنید.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال ایده‌ها و بازخوردهای شما هستیم! اگر تصاویری دارید یا توضیحات بیشتری در مورد امکانات هر ملک، با ما در ارتباط باشید. ما به دنبال بهبود هر چه بیشتر تجربه‌ی شما هستیم.",
      },
    ],
    end1: "این صفحه به زودی به شما شهروندان متاورس خواهد پیوست. ما در حال کشف جزئیات بیشتر هستیم و به زودی شما را در این سفر هیجان‌انگیز به اماکن زیبا و تاریخ‌های جالب همراه می‌کنیم.",
    end2: "با افتخار به سوی آینده،",
    end3: "تیم متاورس 🏰🌟",
  },

  {
    id: 3,
    title: "سازه‌ها (در حال توسعه)",
    hello: "سلام به صفحه فوق‌العاده سازه‌ها خوش آمدید! 🏗️🌆",
    desc: "در اینجا، ما در حال ایجاد یک مرجع جامع برای اطلاعات سازه‌های شگفت‌انگیز متاورس هستیم. این صفحه در حال توسعه است و به زودی به یک نقطه مرجعی برای همه اطلاعات سازه‌های شهروند تبدیل خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "🏰 طبقه‌بندی بر اساس کاربری: ",
        desc: "سازه‌ها بر اساس کاربری‌های متنوع گردشگری، پارک، مراکز بهداشتی، فرهنگی، آموزشی، تجاری، نمایشگاه، مسکونی و سایر کاربری‌ها دسته‌بندی شده‌اند.",
      },
      {
        id: 2,
        title: "🏢 جزئیات ساختمان: ",
        desc: ": اطلاعات مرتبط با تراکم سازه، متراژ بنا، و تعداد ورودی‌های آنلاین زمان پایان ساخت و میزان رضایت لانچ شده ، و مشارکت کننده ها در ساخت برای هر سازه به نمایش درآمده است.",
      },
      {
        id: 3,
        title: "📈 نمودار تاریخچه سازه‌ها: ",
        desc: "یک نمودار کاربردی وجود دارد که با استفاده از آن می‌توانید سازه‌ها را بر اساس تاریخ مشخص شده فیلتر کنید. این امکان به شما کمک می‌کند تا ببینید در چه بازه‌های زمانی ساخت و ساز بیشترین فعالیت را دارد.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای بهبود اطلاعات هر سازه هستیم. اگر اطلاعات یا تصاویر اضافی دارید، با ما به اشتراک بگذارید تا این صفحه را هر روز بهتر کنیم.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی آینده سازه‌های شگفت‌انگیز متاورس،",
    end3: "تیم متاورس 🌇🏰",
  },

  {
    id: 4,
    title: "متعلقات (در حال توسعه)",
    hello: "خوش آمدید به دنیای متعلقات شگفت‌انگیز! 🗝️🎮",
    desc: "در اینجا، ما در حال ایجاد یک صفحه جذاب و خاص برای نمایش متعلقات شهروندان متاورس هستیم. این صفحه در حال توسعه است و به زودی به یک نمایشگاه مرجع برای کلیدها و مدل‌های سه‌بعدی متاورس تبدیل خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "🔑 لیست دارایی‌ها",
        desc: "دارایی‌ها بر اساس دو دسته‌بندی اصلی نمایش داده می‌شوند. اولویت اول شامل کلیدهای کسب شده در چالش آمار سراسری شامل کلید طلا، کلید نقره و کلید برنز است. دسته دوم شامل مدل‌های  سه‌بعدی شهروندان متاورس می‌باشد.",
      },
      {
        id: 2,
        title: "🎨 مدل‌های سه‌بعدی",
        desc: "مدل‌های سه‌بعدی شهروندان به دقت دسته‌بندی شده‌اند. شما می‌توانید دارایی‌های سه‌بعدی دیگر شهروندان را مشاهده کرده و حتی درخواست خرید برای آنها ثبت کنید",
      },
      {
        id: 3,
        title: "📈 نمودار تاریخچه دارایی‌ها: ",
        desc: ": یک نمودار تاریخی حاکی از زمان کسب و یا خریداری دارایی‌ها است. این نمودار به شما این امکان را می‌دهد تا بفهمید که دارایی‌ها در چه بازه‌های زمانی بیشترین فعالیت را داشته‌اند.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای افزایش تنوع و جذابیت متعلقات هستیم. اگر دارایی‌های جدیدی دارید یا ایده‌های جالبی برای بهبود صفحه، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی متعلقات شگفت‌انگیز متاورس،",
    end3: "تیم متاورس 🗝️🌌",
  },

  {
    id: 5,
    title: "مجوزات (در حال توسعه)",
    hello: "به دنیای مجوزات متاورس خوش آمدید! 📜💼",
    desc: "در اینجا، ما در حال ایجاد یک صفحه جامع برای نمایش اطلاعات مربوط به مجوزات شهروندان متاورس هستیم. این صفحه در حال توسعه است و به زودی به یک مرجع جامع برای دریافت اطلاعات مجوزات تبدیل می شود.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "📚 مجوزات تاسیس: ",
        desc: ": مجوزات با عناوین تاسیس فروشگاه، تاسیس آموزشگاه، خبرنگاری، مشارکت‌کننده، توسعه‌دهنده، بازرسی، تجارت، وکالت، شورای شهر، شهرداری، فرمانداری، وزارت، قضاوت، قانونگذاری نمایش داده می‌شود.",
      },
      {
        id: 2,
        title: "📊 اطلاعات مجوزات: ",
        desc: "برای هر مجوز اطلاعاتی نظیر نام مجوز، سطح مجوز، تاریخ دریافت، تاریخ انقضا، تعداد ورودی، نوع فعالیت، و تصویر مجوز در دسترس قرار دارد.",
      },
      {
        id: 3,
        title: "📈 آمار مجوزات: ",
        desc: ": تعداد کل مجوزات، درآمد از کل مجوزات و اطلاعات دقیق‌تری در مورد هر مجوز با ورود به اطلاعات آن دریافت خواهید کرد.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای تکمیل و به‌روزرسانی اطلاعات مجوزات هستیم. اگر اطلاعات یا تصاویری دارید که می‌توانند به اغنای این صفحه بیافزایند، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی مجوزات هوشمند متاورس،",
    end3: "تیم متاورس 📜💼",
  },

  {
    id: 6,
    title: "دعوتی‌ها (در حال توسعه)",
    hello: "به دنیای دعوتی‌ها و پاداش‌های متاورس خوش آمدید! 💌🎉",
    desc: "در اینجا، ما در حال ایجاد یک صفحه پویا برای نمایش اطلاعات دعوت‌ها و پاداش‌های شهروندان متاورس هستیم. این صفحه در حال توسعه است و به زودی به یک مرجع جامع برای دعوت‌ها و پاداش‌ها تبدیل خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "👥 اطلاعات دعوت‌ها: ",
        desc: "نمایش اسامی شهروندانی که توسط مالک صفحه دعوت شده‌اند. مشاهده تعداد کل دعوت‌شدگان (رفرال) و کل پاداش کسب‌شده توسط شهروند معرف ( مالک صفحه ).",
      },
      {
        id: 2,
        title: "💰 جزئیات پاداش‌ها: ",
        desc: ": بررسی میزان پاداشی که هر شهروند دعوت‌شده به حساب مالک صفحه اضافه کرده است.",
      },
      {
        id: 3,
        title: "📈 نمودار تاریخچه: ",
        desc: ": یک نمودار تاریخی که با تنظیم تاریخ، میزان پاداش و دعوت‌شدگان را در بازه‌های زمانی مشاهده می‌کنید.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای بهبود و تکمیل اطلاعات این صفحه هستیم. اگر اطلاعات یا ایده‌هایی دارید که می‌توانند این صفحه را بهتر کنند، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی دنیای دعوتی و پاداش متاورس،",
    end3: "تیم متاورس 💌🌟",
  },

  {
    id: 7,
    title: ": تراکنش‌ها (در حال توسعه)",
    hello: "به دنیای تراکنش‌های شگفت‌انگیز متاورس خوش آمدید! 💸📊",
    desc: "در اینجا، ما در حال ایجاد یک صفحه جامع برای نمایش اطلاعات مربوط به تراکنش‌های شهروندان متاورس هستیم. این صفحه در حال توسعه است و به زودی به یک مرجع کامل برای تاریخچه تراکنش‌ها تبدیل خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "🏠 تراکنش‌های املاک",
        desc: ": اطلاعات درباره املاکی که خریداری یا فروخته شده‌اند.",
      },
      {
        id: 2,
        title: "🛍️ تراکنش‌های محصولات: ",
        desc: "اطلاعات مربوط به محصولاتی که خریداری یا فروخته شده‌اند.",
      },
      {
        id: 3,
        title: "🔑 تراکنش‌های کلیدها: ",
        desc: "جزئیات درباره کلیدهایی که خریداری یا فروخته شده‌اند.",
      },
      {
        id: 4,
        title: "💰 تراکنش‌های ارزها و ابزارها: ",
        desc: ": اطلاعات مربوط به ارزها و ابزارهایی که خریداری شده‌اند.",
      },
      {
        id: 5,
        title: "📈 نمودار تاریخچه تراکنش‌ها: ",
        desc: ": یک نمودار که متناسب با تمام تراکنش‌ها و بازه تاریخ مشخص شده، اطلاعات را به صورت گرافیکی نشان می‌دهد.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای تکمیل و به‌روزرسانی اطلاعات این صفحه هستیم. اگر اطلاعات یا ایده‌هایی دارید که می‌توانند این صفحه را بهبود بخشند، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی دنیای تراکنش و پیشرفت متاورس،",
    end3: "تیم متاورس 💸🌐",
  },

  {
    id: 8,
    title: "پاداش‌ها (در حال توسعه)",
    hello: "به دنیای پاداش‌های خارق‌العاده متاورس خوش آمدید! 🎁📆",
    desc: "در اینجا، ما در حال ایجاد یک صفحه جذاب و جامع برای نمایش اطلاعات پاداش‌های کسب شده در متاورس هستیم. این صفحه در حال توسعه است و به زودی به یک منبع غنی برای مشاهده تمام جوایز و تقدیرها تبدیل خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "🏆 پاداش‌های مختلف: ",
        desc: "نمایش تمام پاداش‌های کسب شده با دسته بندی های مختلف اعم از پاداش از سلسله و پاداش از سطوح که شامل واحد رضایت، حد تاثیر، ارز ریال، ارز PSC، و رنگهای زرد، قرمز، و آبی.",
      },
      {
        id: 2,
        title: "📊 سرجمع پاداش‌ها",
        desc: ": محاسبه سرجمع تمام پاداش‌های کسب شده در تمام بازه‌های زمانی.",
      },
      {
        id: 3,
        title: "📈 نمودار تاریخچه پاداش‌ها",
        desc: ": یک نمودار که جزئیات پاداش‌های دریافت شده را در تاریخ‌های مشخص نشان می‌دهد.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای بهبود و تکمیل اطلاعات این صفحه هستیم. اگر اطلاعات یا ایده‌هایی دارید که می‌توانند این صفحه را بهتر کنند، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی دنیای پاداش و شکوفایی متاورس،",
    end3: "تیم متاورس 🎁🌟",
  },

  {
    id: 9,
    title: ": سلسله (در حال توسعه)",
    hello: "به دنیای گسترده سلسله خانوادگی متاورس خوش آمدید! 👨‍👩‍👧‍👦🏡",
    desc: "در اینجا، ما در حال ایجاد یک صفحه دلنشین و اطلاعاتی برای نمایش سلسله خانوادگی شهروندان متاورس هستیم. این صفحه در حال توسعه است و به زودی به یک راهنمای کامل برای اطلاعات خانوادگی تبدیل خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "👨‍👩‍👧‍👦 اعضای خانواده: ",
        desc: "نمایش اعضای خانواده شهروند به همراه جزئیاتی نظیر تصویر حساب شهروندی، شناسه شهروندی، و نام شهروندی.",
      },
      {
        id: 2,
        title: "🎁 لیست پاداش: ",
        desc: "بخشی از صفحه به عنوان لیست پاداش از معرفی هر عضو خانواده اختصاص یافته است. در این قسمت، می‌توانید جوایز و پاداش‌های قابل دریافت توسط هر عضو را بررسی کنید.",
      },
      {
        id: 3,
        title: "📜 قوانین و چهارچوب سلسله: ",
        desc: "در اینجا، قوانین و چهارچوب سلسله خانوادگی شهروندان به‌صورت دقیق ثبت شده‌اند.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای تکمیل و به‌روزرسانی اطلاعات این صفحه هستیم. اگر اطلاعات یا ایده‌هایی دارید که می‌توانند این صفحه را بهبود بخشند، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی جاده‌های سلسله خانوادگی متاورس،",
    end3: "تیم متاورس 👨‍👩‍👧‍👦🌈",
  },

  {
    id: 10,
    title: "ارتباطات (در حال توسعه)",
    hello: "به دنیای پر از ارتباطات شگفت‌انگیز متاورس خوش آمدید! 🤝🌐",
    desc: "در صفحه ارتباطات، ما قصد داریم یک فضای اجتماعی برای شهروندان متاورس ایجاد کنیم. این صفحه هم اکنون در حال توسعه است و به‌زودی به یک مرکز ارتباطات فعّال تبدیل خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "لیست دنبال کنندگان و دنبال شوندگان",
        desc: ": نمایش لیستی از شهروندانی که مالک صفحه را دنبال کرده‌اند یا توسط او دنبال شده‌اند.",
      },
      {
        id: 2,
        title: "📈 نمودار تاریخچه ارتباطات",
        desc: "یک نمودار که با استفاده از قابلیت تنظیم تاریخ، متوجه می‌شوید در چه تاریخی دنبال کنندگان و دنبال شوندگان بیشتری جذب شده‌اند.",
      },
      {
        id: 3,
        title: "📊 تعداد کل دنبال کنندگان و دنبال شوندگان: ",
        desc: "نمایش تعداد کل دنبال کنندگان و دنبال شوندگان مالک صفحه.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای بهبود و تکمیل اطلاعات این صفحه هستیم. اگر اطلاعات یا ایده‌هایی دارید که می‌توانند این صفحه را بهتر کنند، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی جامعه ارتباطی متاورس،",
    end3: "تیم متاورس 🤝🌐",
  },

  {
    id: 1,
    title: ": جرایم (در حال توسعه)",
    hello: "به دنیای قوانین و انضباط متاورس خوش آمدید! ⚖️🚨",
    desc: "صفحه جرایم در حال حاضر در حال توسعه است و به زودی یک مرجع کامل برای نمایش تخلفات و مباحث قانونی متاورس خواهد شد.",
    subtitleItems: "چه اطلاعاتی در اینجا می‌یابید؟",
    subItems: [
      {
        id: 1,
        title: "لیست تخلفات و جرایم",
        desc: ": نمایش لیستی از تخلفات، نقض قوانین، اخطاریه‌ها، شکایات، مبالغ جریمه‌ها، و مبالغ پرداخت شده جریمه.",
      },
      {
        id: 2,
        title: "📁 پرونده‌های جرمی: ",
        desc: ": ایجاد پرونده برای هر تخلف شامل شماره پرونده، تاریخ ثبت، و مبلغ جریمه.",
      },
      {
        id: 3,
        title: "🔍 جزئیات پرونده: ",
        desc: ": با ورود به هر پرونده، اطلاعات دقیق تری را دریافت کنید؛ شامل تصویر یا ویدیوی جرم، وضعیت پرونده، سطح جرم، تاریخ ارتکاب، حوزه جرم،قاضی پرونده، کارشناس پرونده و غیره.",
      },
    ],
    time: [],
    howHelp: [
      {
        id: 1,
        title: "چطور می‌توانید کمک کنید؟",
        desc: "ما به دنبال همکاری شما برای تکمیل و به‌روزرسانی اطلاعات این صفحه هستیم. اگر اطلاعات یا ایده‌هایی دارید که می‌توانند این صفحه را بهبود بخشند، با ما به اشتراک بگذارید.",
      },
    ],
    end1: "همراه ما باشید!",
    end2: "با افتخار به سوی انضباط و عدالت در دنیای متاورس،",
    end3: "تیم متاورس ⚖️🚨",
  },
];


